TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCRESULT8_12B_M33 Bits */
/* HSADC_ADCRESULT8_12B_M33[RESULT] Bits */
#define HSADC_ADCRESULT8_12B_M33_RESULT_OFS      (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT8_12B_M33_RESULT_MASK     ((uint16_t)0x0000FFFFU)         /* !< ADC Result 8 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC8, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT8_1 Bits */
/* HSADC_ADCRESULT8_1[RESULT] Bits */
#define HSADC_ADCRESULT8_1_RESULT_OFS            (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT8_1_RESULT_MASK           ((uint16_t)0x0000FFFFU)         /* !< ADC Result 8 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC8, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT9_12B_M33 Bits */
/* HSADC_ADCRESULT9_12B_M33[RESULT] Bits */
#define HSADC_ADCRESULT9_12B_M33_RESULT_OFS      (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT9_12B_M33_RESULT_MASK     ((uint16_t)0x0000FFFFU)         /* !< ADC Result 9 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC9, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT9_1 Bits */
/* HSADC_ADCRESULT9_1[RESULT] Bits */
#define HSADC_ADCRESULT9_1_RESULT_OFS            (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT9_1_RESULT_MASK           ((uint16_t)0x0000FFFFU)         /* !< ADC Result 9 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC9, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT10_12B_M33 Bits */
/* HSADC_ADCRESULT10_12B_M33[RESULT] Bits */
#define HSADC_ADCRESULT10_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT10_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 10 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC10, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT10_1 Bits */
/* HSADC_ADCRESULT10_1[RESULT] Bits */
#define HSADC_ADCRESULT10_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT10_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 10 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC10, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT11_12B_M33 Bits */
/* HSADC_ADCRESULT11_12B_M33[RESULT] Bits */
#define HSADC_ADCRESULT11_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT11_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 11 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC11, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT11_1 Bits */
/* HSADC_ADCRESULT11_1[RESULT] Bits */
#define HSADC_ADCRESULT11_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT11_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 11 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC11, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT12_12B_M33 Bits */
/* HSADC_ADCRESULT12_12B_M33[RESULT] Bits */
#define HSADC_ADCRESULT12_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT12_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 12 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC12, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT12_1 Bits */
/* HSADC_ADCRESULT12_1[RESULT] Bits */
#define HSADC_ADCRESULT12_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT12_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 12 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC12, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT13_12B_M33 Bits */
/* HSADC_ADCRESULT13_12B_M33[RESULT] Bits */
#define HSADC_ADCRESULT13_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT13_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 13 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC13, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT13_1 Bits */
/* HSADC_ADCRESULT13_1[RESULT] Bits */
#define HSADC_ADCRESULT13_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT13_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 13 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC13, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT14_12B_M33 Bits */
/* HSADC_ADCRESULT14_12B_M33[RESULT] Bits */
#define HSADC_ADCRESULT14_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT14_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 14 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC14, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

