TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB4RESULT_1 Bits */
/* HSADC_ADCPPB4RESULT_1[PPBRESULT] Bits */
#define HSADC_ADCPPB4RESULT_1_PPBRESULT_OFS      (0)                             /* !< PPBRESULT Offset */
#define HSADC_ADCPPB4RESULT_1_PPBRESULT_MASK     ((uint32_t)0x00001FFFU)         /* !< ADC Post Processing Block Result 4
                                                                                    #br# #br#The result of the
                                                                                    offset/reference subtraction post
                                                                                    conversion processing is stored in
                                                                                    this register.  #br# #br#This result
                                                                                    is available 1 SYSCLK cycle after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC.  In the case of multiple
                                                                                    PPBs associated with the same SOC,
                                                                                    the lowest numbered PPB's result will
                                                                                    be availble 1 SYSCLK cycle after the
                                                                                    associated ADCRESULT and subsequent
                                                                                    results (in order from lowest
                                                                                    numbered PPB to highest) will each
                                                                                    become available every 2-3 SYSCLK
                                                                                    cycles (refer to the TRM for more
                                                                                    detailed timing information).  #br#
                                                                                    #br#If ADCINTFLG is polled to
                                                                                    determine when to read the PPBRESULT,
                                                                                    it may be necessary to add one or
                                                                                    more NOP instructions to ensure that
                                                                                    the updated post conversion
                                                                                    processing result has posted to the
                                                                                    register. #br# #br#NOTE: If the
                                                                                    conversion associated with this Post
                                                                                    Processing Block is a 12-bit
                                                                                    conversion, the PPBRESULT bits are
                                                                                    limited to bits 12:0. */
/* HSADC_ADCPPB4RESULT_1[SIGN] Bits */
#define HSADC_ADCPPB4RESULT_1_SIGN_OFS           (13)                            /* !< SIGN Offset */
#define HSADC_ADCPPB4RESULT_1_SIGN_MASK          ((uint32_t)0xFFFFE000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 12.
                                                                                    #br# #br#NOTE: If the conversion
                                                                                    associated with this Post Processing
                                                                                    Block is a 12-bit conversion, the
                                                                                    SIGN bits extend down to bit 12, and
                                                                                    all reflect the same value as bit 12. */

/* HSADC_ADCPPB1SUM_LITE_ Bits */
/* HSADC_ADCPPB1SUM_LITE_[SUM] Bits */
#define HSADC_ADCPPB1SUM_LITE__SUM_OFS           (0)                             /* !< SUM Offset */
#define HSADC_ADCPPB1SUM_LITE__SUM_MASK          ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 1
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB1RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB1RESULT timing information). */
/* HSADC_ADCPPB1SUM_LITE_[SIGN] Bits */
#define HSADC_ADCPPB1SUM_LITE__SIGN_OFS          (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB1SUM_LITE__SIGN_MASK         ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

