TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB1SUM_1 Bits */
/* HSADC_ADCPPB1SUM_1[SUM] Bits */
#define HSADC_ADCPPB1SUM_1_SUM_OFS               (0)                             /* !< SUM Offset */
#define HSADC_ADCPPB1SUM_1_SUM_MASK              ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 1
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB1RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB1RESULT timing information). */
/* HSADC_ADCPPB1SUM_1[SIGN] Bits */
#define HSADC_ADCPPB1SUM_1_SIGN_OFS              (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB1SUM_1_SIGN_MASK             ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC_ADCPPB1COUNT_LITE_ Bits */
/* HSADC_ADCPPB1COUNT_LITE_[COUNT] Bits */
#define HSADC_ADCPPB1COUNT_LITE__COUNT_OFS       (0)                             /* !< COUNT Offset */
#define HSADC_ADCPPB1COUNT_LITE__COUNT_MASK      ((uint16_t)0x0000000FU)         /* !< Post Processing Block 1
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB1RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB1RESULT timing
                                                                                    information). */

/* HSADC_ADCPPB1COUNT_1 Bits */
/* HSADC_ADCPPB1COUNT_1[COUNT] Bits */
#define HSADC_ADCPPB1COUNT_1_COUNT_OFS           (0)                             /* !< COUNT Offset */
#define HSADC_ADCPPB1COUNT_1_COUNT_MASK          ((uint16_t)0x0000000FU)         /* !< Post Processing Block 1
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB1RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB1RESULT timing
                                                                                    information). */

/* HSADC_ADCPPB2SUM_LITE_ Bits */
/* HSADC_ADCPPB2SUM_LITE_[SUM] Bits */
#define HSADC_ADCPPB2SUM_LITE__SUM_OFS           (0)                             /* !< SUM Offset */
#define HSADC_ADCPPB2SUM_LITE__SUM_MASK          ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB2 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB2RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB2RESULT timing information). */
/* HSADC_ADCPPB2SUM_LITE_[SIGN] Bits */
#define HSADC_ADCPPB2SUM_LITE__SIGN_OFS          (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB2SUM_LITE__SIGN_MASK         ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC_ADCPPB2SUM_1 Bits */
/* HSADC_ADCPPB2SUM_1[SUM] Bits */
#define HSADC_ADCPPB2SUM_1_SUM_OFS               (0)                             /* !< SUM Offset */
#define HSADC_ADCPPB2SUM_1_SUM_MASK              ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB2 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB2RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB2RESULT timing information). */
/* HSADC_ADCPPB2SUM_1[SIGN] Bits */
#define HSADC_ADCPPB2SUM_1_SIGN_OFS              (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB2SUM_1_SIGN_MASK             ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

