TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB2MAX Bits */
/* HSADC_ADCPPB2MAX[MAX] Bits */
#define HSADC_ADCPPB2MAX_MAX_OFS                 (0)                             /* !< MAX Offset */
#define HSADC_ADCPPB2MAX_MAX_MASK                ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Final Max. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB2 receives a sync.
                                                                                    event, the value of PMAX is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the max loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#This result is available 1
                                                                                    SYSCLK cycle after the associated
                                                                                    ADCPPB2RESULT is available (only when
                                                                                    a count-match event occurs).  This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB2RESULT
                                                                                    timing information). */
/* HSADC_ADCPPB2MAX[SIGN] Bits */
#define HSADC_ADCPPB2MAX_SIGN_OFS                (17)                            /* !< SIGN Offset */
#define HSADC_ADCPPB2MAX_SIGN_MASK               ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC_ADCPPB2MAXI Bits */
/* HSADC_ADCPPB2MAXI[MAXI] Bits */
#define HSADC_ADCPPB2MAXI_MAXI_OFS               (0)                             /* !< MAXI Offset */
#define HSADC_ADCPPB2MAXI_MAXI_MASK              ((uint16_t)0x000003FFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Final Index of the Max.
                                                                                    When either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB2
                                                                                    receives a sync. event, the value of
                                                                                    PMAXI is loaded into this register.
                                                                                    In the case of a count-match event,
                                                                                    the max index loaded into this
                                                                                    register includes the value from the
                                                                                    most recent conversion.  #br#
                                                                                    #br#This result is available 1 SYSCLK
                                                                                    cycle after the associated
                                                                                    ADCPPB2RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB2RESULT
                                                                                    timing information). */

/* HSADC_ADCPPB2MIN Bits */
/* HSADC_ADCPPB2MIN[MIN] Bits */
#define HSADC_ADCPPB2MIN_MIN_OFS                 (0)                             /* !< MIN Offset */
#define HSADC_ADCPPB2MIN_MIN_MASK                ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Final Min. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB2 receives a sync.
                                                                                    event, the value of PMIN is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the max loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#This result is available 1
                                                                                    SYSCLK cycle after the associated
                                                                                    ADCPPB2RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB2RESULT
                                                                                    timing information). */
/* HSADC_ADCPPB2MIN[SIGN] Bits */
#define HSADC_ADCPPB2MIN_SIGN_OFS                (17)                            /* !< SIGN Offset */
#define HSADC_ADCPPB2MIN_SIGN_MASK               ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC_ADCPPB2MINI Bits */
/* HSADC_ADCPPB2MINI[MINI] Bits */
#define HSADC_ADCPPB2MINI_MINI_OFS               (0)                             /* !< MINI Offset */
#define HSADC_ADCPPB2MINI_MINI_MASK              ((uint16_t)0x000003FFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Final Index of the Min.
                                                                                    When either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB2
                                                                                    receives a sync. event, the value of
                                                                                    PMINI is loaded into this register.
                                                                                    In the case of a count-match event,
                                                                                    the min index loaded into this
                                                                                    register includes the value from the
                                                                                    most recent conversion.  #br#
                                                                                    #br#This result is available 1 SYSCLK
                                                                                    cycle after the associated
                                                                                    ADCPPB2RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB2RESULT
                                                                                    timing information). */

/* HSADC_ADCPPB3MAX Bits */
/* HSADC_ADCPPB3MAX[MAX] Bits */
#define HSADC_ADCPPB3MAX_MAX_OFS                 (0)                             /* !< MAX Offset */
#define HSADC_ADCPPB3MAX_MAX_MASK                ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 3
                                                                                    Oversampling Final Max. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event, the value of PMAX is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the max loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#This result is available 1
                                                                                    SYSCLK cycle after the associated
                                                                                    ADCPPB3RESULT is available (only when
                                                                                    a count-match event occurs).  This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB3RESULT
                                                                                    timing information). */
/* HSADC_ADCPPB3MAX[SIGN] Bits */
#define HSADC_ADCPPB3MAX_SIGN_OFS                (17)                            /* !< SIGN Offset */
#define HSADC_ADCPPB3MAX_SIGN_MASK               ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

