TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB4MAXI Bits */
/* HSADC_ADCPPB4MAXI[MAXI] Bits */
#define HSADC_ADCPPB4MAXI_MAXI_OFS               (0)                             /* !< MAXI Offset */
#define HSADC_ADCPPB4MAXI_MAXI_MASK              ((uint16_t)0x000003FFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Index of the Max.
                                                                                    When either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB4
                                                                                    receives a sync. event, the value of
                                                                                    PMAXI is loaded into this register.
                                                                                    In the case of a count-match event,
                                                                                    the max index loaded into this
                                                                                    register includes the value from the
                                                                                    most recent conversion.  #br#
                                                                                    #br#This result is available 1 SYSCLK
                                                                                    cycle after the associated
                                                                                    ADCPPB4RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB4RESULT
                                                                                    timing information). */

/* HSADC_ADCPPB4MIN Bits */
/* HSADC_ADCPPB4MIN[MIN] Bits */
#define HSADC_ADCPPB4MIN_MIN_OFS                 (0)                             /* !< MIN Offset */
#define HSADC_ADCPPB4MIN_MIN_MASK                ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Min. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PMIN is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the max loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#This result is available 1
                                                                                    SYSCLK cycle after the associated
                                                                                    ADCPPB4RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB4RESULT
                                                                                    timing information). */
/* HSADC_ADCPPB4MIN[SIGN] Bits */
#define HSADC_ADCPPB4MIN_SIGN_OFS                (17)                            /* !< SIGN Offset */
#define HSADC_ADCPPB4MIN_SIGN_MASK               ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC_ADCPPB4MINI Bits */
/* HSADC_ADCPPB4MINI[MINI] Bits */
#define HSADC_ADCPPB4MINI_MINI_OFS               (0)                             /* !< MINI Offset */
#define HSADC_ADCPPB4MINI_MINI_MASK              ((uint16_t)0x000003FFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Index of the Min.
                                                                                    When either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB4
                                                                                    receives a sync. event, the value of
                                                                                    PMINI is loaded into this register.
                                                                                    In the case of a count-match event,
                                                                                    the min index loaded into this
                                                                                    register includes the value from the
                                                                                    most recent conversion.  #br#
                                                                                    #br#This result is available 1 SYSCLK
                                                                                    cycle after the associated
                                                                                    ADCPPB4RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB4RESULT
                                                                                    timing information). */

/* HSADC_ADCSEQ1FIFORESULT Bits */
/* HSADC_ADCSEQ1FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC_ADCSEQ1FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC_ADCSEQ1FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 1 Result in FIFO mode */

/* HSADC_ADCSEQ2FIFORESULT Bits */
/* HSADC_ADCSEQ2FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC_ADCSEQ2FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC_ADCSEQ2FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 2 Result in FIFO mode */

/* HSADC_ADCSEQ3FIFORESULT Bits */
/* HSADC_ADCSEQ3FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC_ADCSEQ3FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC_ADCSEQ3FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 3 Result in FIFO mode */

/* HSADC_ADCSEQ4FIFORESULT Bits */
/* HSADC_ADCSEQ4FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC_ADCSEQ4FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC_ADCSEQ4FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 4 Result in FIFO mode */

/* HSADC_ADCSEQ1FIFOSTATUS Bits */
/* HSADC_ADCSEQ1FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 1 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC_ADCSEQ1FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 1 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ1FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC_ADCSEQ2FIFOSTATUS Bits */
/* HSADC_ADCSEQ2FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC_ADCSEQ2FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC_ADCSEQ2FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 2 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC_ADCSEQ2FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC_ADCSEQ2FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC_ADCSEQ2FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 2 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ2FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC_ADCSEQ3FIFOSTATUS Bits */
/* HSADC_ADCSEQ3FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC_ADCSEQ3FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC_ADCSEQ3FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 3 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC_ADCSEQ3FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC_ADCSEQ3FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC_ADCSEQ3FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 3 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ3FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

