TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCSEQ4FIFOSTATUS Bits */
/* HSADC_ADCSEQ4FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC_ADCSEQ4FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC_ADCSEQ4FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 4 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC_ADCSEQ4FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC_ADCSEQ4FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC_ADCSEQ4FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 4 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ4FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC_ADCCTL1_LITE_ Bits */
/* HSADC_ADCCTL1_LITE_[INTPULSEPOS] Bits */
#define HSADC_ADCCTL1_LITE__INTPULSEPOS_OFS      (2)                             /* !< INTPULSEPOS Offset */
#define HSADC_ADCCTL1_LITE__INTPULSEPOS_MASK     ((uint32_t)0x00000004U)         /* !< ADC Interrupt Pulse Position. #br#
                                                                                    #br#  0  Interrupt  pulse generation
                                                                                    occurs when ADC begins conversion (at
                                                                                    the end of the acquisition window)
                                                                                    plus a number of SYSCLK cycles as
                                                                                    specified in the ADCINTCYCLE.OFFSET
                                                                                    register. #br#  1  Interrupt pulse
                                                                                    generation occurs at the end of the
                                                                                    conversion, 1 cycle prior to the ADC
                                                                                    result latching into its result
                                                                                    register */
/* HSADC_ADCCTL1_LITE_[ADCPWDNZ] Bits */
#define HSADC_ADCCTL1_LITE__ADCPWDNZ_OFS         (7)                             /* !< ADCPWDNZ Offset */
#define HSADC_ADCCTL1_LITE__ADCPWDNZ_MASK        ((uint32_t)0x00000080U)         /* !< ADC Power Down (active low). This
                                                                                    bit controls the power up and power
                                                                                    down of all the analog circuitry
                                                                                    inside the analog core. #br# #br#  0
                                                                                    All analog circuitry inside the core
                                                                                    is powered down #br#  1  All analog
                                                                                    circuitry inside the core is powered
                                                                                    up */
/* HSADC_ADCCTL1_LITE_[ADCBSYCHN] Bits */
#define HSADC_ADCCTL1_LITE__ADCBSYCHN_OFS        (8)                             /* !< ADCBSYCHN Offset */
#define HSADC_ADCCTL1_LITE__ADCBSYCHN_MASK       ((uint32_t)0x00000F00U)         /* !< ADC Busy Channel. Set when an ADC
                                                                                    Start of Conversion (SOC) is
                                                                                    generated. #br#When ADCBSY=0: holds
                                                                                    the value of the last converted SOC
                                                                                    #br#When ADCBSY=1: reflects the SOC
                                                                                    currently being processed #br#  0h
                                                                                    SOC0 is currently processing or was
                                                                                    last SOC converted #br#  1h  SOC1 is
                                                                                    currently processing or was last SOC
                                                                                    converted #br#  2h  SOC2 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  3h  SOC3 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  4h  SOC4 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  5h  SOC5 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  6h  SOC6 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  7h  SOC7 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  8h  SOC8 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  9h  SOC9 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ah  SOC10 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Bh  SOC11 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ch  SOC12 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Dh  SOC13 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Eh  SOC14 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Fh  SOC15 is currently
                                                                                    processing or was last SOC converted */
/* HSADC_ADCCTL1_LITE_[ADCBSY] Bits */
#define HSADC_ADCCTL1_LITE__ADCBSY_OFS           (13)                            /* !< ADCBSY Offset */
#define HSADC_ADCCTL1_LITE__ADCBSY_MASK          ((uint32_t)0x00002000U)         /* !< ADC Busy. Set when ADC SOC is
                                                                                    generated, cleared by hardware four
                                                                                    ADC clocks after negative edge of S/H
                                                                                    pulse. Used by the ADC state machine
                                                                                    to determine if ADC is available to
                                                                                    sample. #br# #br#  0  ADC is
                                                                                    available to sample next channel #br#
                                                                                    1  ADC is busy and cannot sample
                                                                                    another channel */

/* HSADC_ADCCTL1_1 Bits */
/* HSADC_ADCCTL1_1[INTPULSEPOS] Bits */
#define HSADC_ADCCTL1_1_INTPULSEPOS_OFS          (2)                             /* !< INTPULSEPOS Offset */
#define HSADC_ADCCTL1_1_INTPULSEPOS_MASK         ((uint32_t)0x00000004U)         /* !< ADC Interrupt Pulse Position. #br#
                                                                                    #br#  0  Interrupt  pulse generation
                                                                                    occurs when ADC begins conversion (at
                                                                                    the end of the acquisition window)
                                                                                    plus a number of SYSCLK cycles as
                                                                                    specified in the ADCINTCYCLE.OFFSET
                                                                                    register. #br#  1  Interrupt pulse
                                                                                    generation occurs at the end of the
                                                                                    conversion, 1 cycle prior to the ADC
                                                                                    result latching into its result
                                                                                    register */
/* HSADC_ADCCTL1_1[ADCPWDNZ] Bits */
#define HSADC_ADCCTL1_1_ADCPWDNZ_OFS             (7)                             /* !< ADCPWDNZ Offset */
#define HSADC_ADCCTL1_1_ADCPWDNZ_MASK            ((uint32_t)0x00000080U)         /* !< ADC Power Down (active low). This
                                                                                    bit controls the power up and power
                                                                                    down of all the analog circuitry
                                                                                    inside the analog core. #br# #br#  0
                                                                                    All analog circuitry inside the core
                                                                                    is powered down #br#  1  All analog
                                                                                    circuitry inside the core is powered
                                                                                    up */
/* HSADC_ADCCTL1_1[ADCBSYCHN] Bits */
#define HSADC_ADCCTL1_1_ADCBSYCHN_OFS            (8)                             /* !< ADCBSYCHN Offset */
#define HSADC_ADCCTL1_1_ADCBSYCHN_MASK           ((uint32_t)0x00000F00U)         /* !< ADC Busy Channel. Set when an ADC
                                                                                    Start of Conversion (SOC) is
                                                                                    generated. #br#When ADCBSY=0: holds
                                                                                    the value of the last converted SOC
                                                                                    #br#When ADCBSY=1: reflects the SOC
                                                                                    currently being processed #br#  0h
                                                                                    SOC0 is currently processing or was
                                                                                    last SOC converted #br#  1h  SOC1 is
                                                                                    currently processing or was last SOC
                                                                                    converted #br#  2h  SOC2 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  3h  SOC3 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  4h  SOC4 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  5h  SOC5 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  6h  SOC6 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  7h  SOC7 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  8h  SOC8 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  9h  SOC9 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ah  SOC10 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Bh  SOC11 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ch  SOC12 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Dh  SOC13 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Eh  SOC14 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Fh  SOC15 is currently
                                                                                    processing or was last SOC converted */
/* HSADC_ADCCTL1_1[ADCBSY] Bits */
#define HSADC_ADCCTL1_1_ADCBSY_OFS               (13)                            /* !< ADCBSY Offset */
#define HSADC_ADCCTL1_1_ADCBSY_MASK              ((uint32_t)0x00002000U)         /* !< ADC Busy. Set when ADC SOC is
                                                                                    generated, cleared by hardware four
                                                                                    ADC clocks after negative edge of S/H
                                                                                    pulse. Used by the ADC state machine
                                                                                    to determine if ADC is available to
                                                                                    sample. #br# #br#  0  ADC is
                                                                                    available to sample next channel #br#
                                                                                    1  ADC is busy and cannot sample
                                                                                    another channel */

/* HSADC_ADCCTL2_LITE_ Bits */
/* HSADC_ADCCTL2_LITE_[PRESCALE] Bits */
#define HSADC_ADCCTL2_LITE__PRESCALE_OFS         (0)                             /* !< PRESCALE Offset */
#define HSADC_ADCCTL2_LITE__PRESCALE_MASK        ((uint32_t)0x0000000FU)         /* !< ADC Clock Prescaler. #br#  0000
                                                                                    ADCCLK = Input Clock / 1.0 #br#  0001
                                                                                    ADCCLK = Input Clock / 1.5 #br#
                                                                                    0010  ADCCLK = Input Clock / 2.0 #br#
                                                                                    0011  ADCCLK = Input Clock / 2.5
                                                                                    #br#  0100  ADCCLK = Input Clock /
                                                                                    3.0 #br#  0101  ADCCLK = Input Clock
                                                                                    / 3.5 #br#  0110  ADCCLK = Input
                                                                                    Clock / 4.0 #br#  0111  ADCCLK =
                                                                                    Input Clock / 4.5 #br#  1000  ADCCLK
                                                                                    = Input Clock / 5.0 #br#  1001
                                                                                    ADCCLK = Input Clock / 5.5 #br#  1010
                                                                                    ADCCLK = Input Clock / 6.0 #br#
                                                                                    1011  ADCCLK = Input Clock / 6.5 #br#
                                                                                    1100  ADCCLK = Input Clock / 7.0
                                                                                    #br#  1101  ADCCLK = Input Clock /
                                                                                    7.5 #br#  1110  ADCCLK = Input Clock
                                                                                    / 8.0 #br#  1111  ADCCLK = Input
                                                                                    Clock / 8.5 */
/* HSADC_ADCCTL2_LITE_[RESOLUTION] Bits */
#define HSADC_ADCCTL2_LITE__RESOLUTION_OFS       (6)                             /* !< RESOLUTION Offset */
#define HSADC_ADCCTL2_LITE__RESOLUTION_MASK      ((uint32_t)0x00000040U)         /* !< SOC Conversion Resolution. Selects
                                                                                    the resolution of the converter. Use
                                                                                    the AdcSetMode function to change the
                                                                                    resolution. #br#  0  12-bit
                                                                                    resolution #br#  1  16-bit resolution */
/* HSADC_ADCCTL2_LITE_[SIGNALMODE] Bits */
#define HSADC_ADCCTL2_LITE__SIGNALMODE_OFS       (7)                             /* !< SIGNALMODE Offset */
#define HSADC_ADCCTL2_LITE__SIGNALMODE_MASK      ((uint32_t)0x00000080U)         /* !< SOC Signaling Mode. Selects the
                                                                                    input mode of the converter. Use the
                                                                                    AdcSetMode function to change the
                                                                                    signal mode. #br#  0  Single-ended
                                                                                    #br#  1  Differential */
/* HSADC_ADCCTL2_LITE_[DEBUGMODE] Bits */
#define HSADC_ADCCTL2_LITE__DEBUGMODE_OFS        (8)                             /* !< DEBUGMODE Offset */
#define HSADC_ADCCTL2_LITE__DEBUGMODE_MASK       ((uint32_t)0x00000100U)         /* !< ADC Clocking Mode. Selects the
                                                                                    number of ADCCLK pulses to be
                                                                                    generated to the converter. #br#  0
                                                                                    Default mode - Generate only
                                                                                    sufficient number of clocks based on
                                                                                    Resolution and Sample Cap reset. #br#
                                                                                    1  Debug mode - Generate 2
                                                                                    additional ADCCLK pulses for every
                                                                                    conversion. */

