TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCCTL2_1 Bits */
/* HSADC_ADCCTL2_1[PRESCALE] Bits */
#define HSADC_ADCCTL2_1_PRESCALE_OFS             (0)                             /* !< PRESCALE Offset */
#define HSADC_ADCCTL2_1_PRESCALE_MASK            ((uint32_t)0x0000000FU)         /* !< ADC Clock Prescaler. #br#  0000
                                                                                    ADCCLK = Input Clock / 1.0 #br#  0001
                                                                                    ADCCLK = Input Clock / 1.5 #br#
                                                                                    0010  ADCCLK = Input Clock / 2.0 #br#
                                                                                    0011  ADCCLK = Input Clock / 2.5
                                                                                    #br#  0100  ADCCLK = Input Clock /
                                                                                    3.0 #br#  0101  ADCCLK = Input Clock
                                                                                    / 3.5 #br#  0110  ADCCLK = Input
                                                                                    Clock / 4.0 #br#  0111  ADCCLK =
                                                                                    Input Clock / 4.5 #br#  1000  ADCCLK
                                                                                    = Input Clock / 5.0 #br#  1001
                                                                                    ADCCLK = Input Clock / 5.5 #br#  1010
                                                                                    ADCCLK = Input Clock / 6.0 #br#
                                                                                    1011  ADCCLK = Input Clock / 6.5 #br#
                                                                                    1100  ADCCLK = Input Clock / 7.0
                                                                                    #br#  1101  ADCCLK = Input Clock /
                                                                                    7.5 #br#  1110  ADCCLK = Input Clock
                                                                                    / 8.0 #br#  1111  ADCCLK = Input
                                                                                    Clock / 8.5 */
/* HSADC_ADCCTL2_1[RESOLUTION] Bits */
#define HSADC_ADCCTL2_1_RESOLUTION_OFS           (6)                             /* !< RESOLUTION Offset */
#define HSADC_ADCCTL2_1_RESOLUTION_MASK          ((uint32_t)0x00000040U)         /* !< SOC Conversion Resolution. Selects
                                                                                    the resolution of the converter. Use
                                                                                    the AdcSetMode function to change the
                                                                                    resolution. #br#  0  12-bit
                                                                                    resolution #br#  1  16-bit resolution */
/* HSADC_ADCCTL2_1[SIGNALMODE] Bits */
#define HSADC_ADCCTL2_1_SIGNALMODE_OFS           (7)                             /* !< SIGNALMODE Offset */
#define HSADC_ADCCTL2_1_SIGNALMODE_MASK          ((uint32_t)0x00000080U)         /* !< SOC Signaling Mode. Selects the
                                                                                    input mode of the converter. Use the
                                                                                    AdcSetMode function to change the
                                                                                    signal mode. #br#  0  Single-ended
                                                                                    #br#  1  Differential */
/* HSADC_ADCCTL2_1[DEBUGMODE] Bits */
#define HSADC_ADCCTL2_1_DEBUGMODE_OFS            (8)                             /* !< DEBUGMODE Offset */
#define HSADC_ADCCTL2_1_DEBUGMODE_MASK           ((uint32_t)0x00000100U)         /* !< ADC Clocking Mode. Selects the
                                                                                    number of ADCCLK pulses to be
                                                                                    generated to the converter. #br#  0
                                                                                    Default mode - Generate only
                                                                                    sufficient number of clocks based on
                                                                                    Resolution and Sample Cap reset. #br#
                                                                                    1  Debug mode - Generate 2
                                                                                    additional ADCCLK pulses for every
                                                                                    conversion. */

/* HSADC_ADCBURSTCTL_LITE_ Bits */
/* HSADC_ADCBURSTCTL_LITE_[BURSTTRIGSEL] Bits */
#define HSADC_ADCBURSTCTL_LITE__BURSTTRIGSEL_OFS (0)                             /* !< BURSTTRIGSEL Offset */
#define HSADC_ADCBURSTCTL_LITE__BURSTTRIGSEL_MASK ((uint32_t)0x0000001FU)         /* !< SOC Burst Trigger Source Select.
                                                                                    Configures which trigger will start a
                                                                                    burst conversion sequence. #br#
                                                                                    #br#Note: SOCFRC1 register can always
                                                                                    be used to software trigger SOCs in
                                                                                    addition to any hardware trigger
                                                                                    configuration. #br#  00h  BURSTTRIG0
                                                                                    - Software only #br#  01h - 3Fh -
                                                                                    Hardware Triggers */
/* HSADC_ADCBURSTCTL_LITE_[BURSTSIZE] Bits */
#define HSADC_ADCBURSTCTL_LITE__BURSTSIZE_OFS    (8)                             /* !< BURSTSIZE Offset */
#define HSADC_ADCBURSTCTL_LITE__BURSTSIZE_MASK   ((uint32_t)0x00000F00U)         /* !< SOC Burst Size Select. This bit
                                                                                    field determines how many SOCs are
                                                                                    converted when a burst conversion
                                                                                    sequence is started. The first SOC
                                                                                    converted is defined by the round
                                                                                    robin pointer, which is advanced as
                                                                                    each SOC is converted. #br# #br#  0h
                                                                                    1 SOC converted #br#  1h  2 SOCs
                                                                                    converted #br#  2h  3 SOCs converted
                                                                                    #br#  3h  4 SOCs converted #br#  4h
                                                                                    5 SOCs converted #br#  5h  6 SOCs
                                                                                    converted #br#  6h  7 SOCs converted
                                                                                    #br#  7h  8 SOCs converted #br#  8h
                                                                                    9 SOCs converted #br#  9h  10 SOCs
                                                                                    converted #br#  Ah  11 SOCs converted
                                                                                    #br#  Bh  12 SOCs converted #br#  Ch
                                                                                    13 SOCs converted #br#  Dh  14 SOCs
                                                                                    converted #br#  Eh  15 SOCs converted
                                                                                    #br#  Fh  16 SOCs converted */
/* HSADC_ADCBURSTCTL_LITE_[BURSTEN] Bits */
#define HSADC_ADCBURSTCTL_LITE__BURSTEN_OFS      (15)                            /* !< BURSTEN Offset */
#define HSADC_ADCBURSTCTL_LITE__BURSTEN_MASK     ((uint32_t)0x00008000U)         /* !< SOC Burst Mode Enable. This bit
                                                                                    enables the SOC Burst Mode of
                                                                                    operation. #br# #br#  0  Burst mode
                                                                                    is disabled. #br#  1  Burst mode is
                                                                                    enabled. */

