TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCRAWINTFLG_4INT Bits */
/* HSADC_ADCRAWINTFLG_4INT[ADCRAWINT1] Bits */
#define HSADC_ADCRAWINTFLG_4INT_ADCRAWINT1_OFS   (0)                             /* !< ADCRAWINT1 Offset */
#define HSADC_ADCRAWINTFLG_4INT_ADCRAWINT1_MASK  ((uint32_t)0x00000001U)         /* !< ADC RAW Interrupt 1 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated INT condition occurred.
                                                                                    This flag will be set irrespective of
                                                                                    corresponding INTE setting #br# #br#
                                                                                    0  Selected EOC/OSINT event did not
                                                                                    occur #br#  1  Selected EOC/OSINT
                                                                                    event occurred #br# #br#Writing
                                                                                    corresponding INTCLR bit in
                                                                                    ADCINTFLGCLR register will clear this
                                                                                    bit. */
/* HSADC_ADCRAWINTFLG_4INT[ADCRAWINT2] Bits */
#define HSADC_ADCRAWINTFLG_4INT_ADCRAWINT2_OFS   (1)                             /* !< ADCRAWINT2 Offset */
#define HSADC_ADCRAWINTFLG_4INT_ADCRAWINT2_MASK  ((uint32_t)0x00000002U)         /* !< ADC RAW Interrupt 2 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated INT condition occurred.
                                                                                    This flag will be set irrespective of
                                                                                    corresponding INTE setting #br# #br#
                                                                                    0  Selected EOC/OSINT event did not
                                                                                    occur #br#  1  Selected EOC/OSINT
                                                                                    event occured #br# #br#Writing
                                                                                    corresponding INTCLR bit in
                                                                                    ADCINTFLGCLR register will clear this
                                                                                    bit. */
/* HSADC_ADCRAWINTFLG_4INT[ADCRAWINT3] Bits */
#define HSADC_ADCRAWINTFLG_4INT_ADCRAWINT3_OFS   (2)                             /* !< ADCRAWINT3 Offset */
#define HSADC_ADCRAWINTFLG_4INT_ADCRAWINT3_MASK  ((uint32_t)0x00000004U)         /* !< ADC RAW Interrupt 3 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated INT condition occurred.
                                                                                    This flag will be set irrespective of
                                                                                    corresponding INTE setting #br# #br#
                                                                                    0  Selected EOC/OSINT event did not
                                                                                    occur #br#  1  Selected EOC/OSINT
                                                                                    event occured #br# #br#Writing
                                                                                    corresponding INTCLR bit in
                                                                                    ADCINTFLGCLR register will clear this
                                                                                    bit. */
/* HSADC_ADCRAWINTFLG_4INT[ADCRAWINT4] Bits */
#define HSADC_ADCRAWINTFLG_4INT_ADCRAWINT4_OFS   (3)                             /* !< ADCRAWINT4 Offset */
#define HSADC_ADCRAWINTFLG_4INT_ADCRAWINT4_MASK  ((uint32_t)0x00000008U)         /* !< ADC RAW Interrupt 4 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated INT condition occurred.
                                                                                    This flag will be set irrespective of
                                                                                    corresponding INTE setting #br# #br#
                                                                                    0  Selected EOC/OSINT event did not
                                                                                    occur #br#  1  Selected EOC/OSINT
                                                                                    event occured #br# #br#Writing
                                                                                    corresponding INTCLR bit in
                                                                                    ADCINTFLGCLR register will clear this
                                                                                    bit. */
/* HSADC_ADCRAWINTFLG_4INT[ADCDMARAWINT1] Bits */
#define HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT1_OFS (16)                            /* !< ADCDMARAWINT1 Offset */
#define HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT1_MASK ((uint32_t)0x00010000U)         /* !< ADC DMA Raw Interrupt 1 Flag.
                                                                                    Reading these flags indicates if the
                                                                                    associated ADCDMAINT condition
                                                                                    occurred. This flag will be set
                                                                                    irrespective of corresponding DMAINTE
                                                                                    setting #br# #br#  0  Selected
                                                                                    EOC/OSINT event did not occur #br#  1
                                                                                    Selected EOC/OSINT event occurred
                                                                                    #br# #br#Writing corresponding INTCLR
                                                                                    bit in ADCINTFLGCLR register will
                                                                                    clear this bit. */
/* HSADC_ADCRAWINTFLG_4INT[ADCDMARAWINT2] Bits */
#define HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT2_OFS (17)                            /* !< ADCDMARAWINT2 Offset */
#define HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT2_MASK ((uint32_t)0x00020000U)         /* !< ADC DMA Raw Interrupt 2 Flag.
                                                                                    Reading these flags indicates if the
                                                                                    associated ADCDMAINT condition
                                                                                    occurred. This flag will be set
                                                                                    irrespective of corresponding DMAINTE
                                                                                    setting #br# #br#  0  Selected
                                                                                    EOC/OSINT event did not occur #br#  1
                                                                                    Selected EOC/OSINT event occurred
                                                                                    #br# #br#Writing corresponding INTCLR
                                                                                    bit in ADCINTFLGCLR register will
                                                                                    clear this bit. */
/* HSADC_ADCRAWINTFLG_4INT[ADCDMARAWINT3] Bits */
#define HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT3_OFS (18)                            /* !< ADCDMARAWINT3 Offset */
#define HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT3_MASK ((uint32_t)0x00040000U)         /* !< ADC DMA Raw Interrupt 3 Flag.
                                                                                    Reading these flags indicates if the
                                                                                    associated ADCDMAINT condition
                                                                                    occurred. This flag will be set
                                                                                    irrespective of corresponding DMAINTE
                                                                                    setting #br# #br#  0  Selected
                                                                                    EOC/OSINT event did not occur #br#  1
                                                                                    Selected EOC/OSINT event occurred
                                                                                    #br# #br#Writing corresponding INTCLR
                                                                                    bit in ADCINTFLGCLR register will
                                                                                    clear this bit. */
/* HSADC_ADCRAWINTFLG_4INT[ADCDMARAWINT4] Bits */
#define HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT4_OFS (19)                            /* !< ADCDMARAWINT4 Offset */
#define HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT4_MASK ((uint32_t)0x00080000U)         /* !< ADC DMA Raw Interrupt 4 Flag.
                                                                                    Reading these flags indicates if the
                                                                                    associated ADCDMAINT condition
                                                                                    occurred. This flag will be set
                                                                                    irrespective of corresponding DMAINTE
                                                                                    setting #br# #br#  0  Selected
                                                                                    EOC/OSINT event did not occur #br#  1
                                                                                    Selected EOC/OSINT event occurred
                                                                                    #br# #br#Writing corresponding INTCLR
                                                                                    bit in ADCINTFLGCLR register will
                                                                                    clear this bit. */

