TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
                                                                                    interrupt overflow event occurs in
                                                                                    the ADCINTOVF register. */
/* HSADC_ADCINTFLG_1[ADCDMAINT2] Bits */
#define HSADC_ADCINTFLG_1_ADCDMAINT2_OFS         (17)                            /* !< ADCDMAINT2 Offset */
#define HSADC_ADCINTFLG_1_ADCDMAINT2_MASK        ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interrupt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    DMA interrupt is placed in continue
                                                                                    to interrupt mode (DMAINTSEL
                                                                                    register) then further interrupt
                                                                                    pulses are generated whenever a
                                                                                    selected EOC event occurs even if the
                                                                                    flag bit is set. If the continuous
                                                                                    mode is not enabled, then no further
                                                                                    interrupt pulses are generated until
                                                                                    the user clears this flag bit using
                                                                                    the ADCINTFLGCLR register. Rather, an
                                                                                    ADC interrupt overflow event occurs
                                                                                    in the ADCINTOVF register. */
/* HSADC_ADCINTFLG_1[ADCDMAINT3] Bits */
#define HSADC_ADCINTFLG_1_ADCDMAINT3_OFS         (18)                            /* !< ADCDMAINT3 Offset */
#define HSADC_ADCINTFLG_1_ADCDMAINT3_MASK        ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interrupt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    interrupt is placed in continue to
                                                                                    interrupt mode (DMAINTSEL register)
                                                                                    then further interrupt pulses are
                                                                                    generated whenever a selected EOC
                                                                                    event occurs even if the flag bit is
                                                                                    set. If the continuous mode is not
                                                                                    enabled, then no further interrupt
                                                                                    pulses are generated until the user
                                                                                    clears this flag bit using the
                                                                                    ADCINTFLGCLR register. Rather, an ADC
                                                                                    interrupt overflow event occurs in
                                                                                    the ADCINTOVF register. */
/* HSADC_ADCINTFLG_1[ADCDMAINT4] Bits */
#define HSADC_ADCINTFLG_1_ADCDMAINT4_OFS         (19)                            /* !< ADCDMAINT4 Offset */
#define HSADC_ADCINTFLG_1_ADCDMAINT4_MASK        ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interru4pt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    interrupt is placed in continue to
                                                                                    interrupt mode (DMAINTSEL register)
                                                                                    then further interrupt pulses are
                                                                                    generated whenever a selected EOC
                                                                                    event occurs even if the flag bit is
                                                                                    set. If the continuous mode is not
                                                                                    enabled, then no further interrupt
                                                                                    pulses are generated until the user
                                                                                    clears this flag bit using the
                                                                                    ADCINTFLGCLR register. Rather, an ADC
                                                                                    interrupt overflow event occurs in
                                                                                    the ADCINTOVF register. */

/* HSADC_ADCINTFLGFRC_4INT Bits */
/* HSADC_ADCINTFLGFRC_4INT[ADCINT1] Bits */
#define HSADC_ADCINTFLGFRC_4INT_ADCINT1_OFS      (0)                             /* !< ADCINT1 Offset */
#define HSADC_ADCINTFLGFRC_4INT_ADCINT1_MASK     ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT1 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_4INT[ADCINT2] Bits */
#define HSADC_ADCINTFLGFRC_4INT_ADCINT2_OFS      (1)                             /* !< ADCINT2 Offset */
#define HSADC_ADCINTFLGFRC_4INT_ADCINT2_MASK     ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT2 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_4INT[ADCINT3] Bits */
#define HSADC_ADCINTFLGFRC_4INT_ADCINT3_OFS      (2)                             /* !< ADCINT3 Offset */
#define HSADC_ADCINTFLGFRC_4INT_ADCINT3_MASK     ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT3 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_4INT[ADCINT4] Bits */
#define HSADC_ADCINTFLGFRC_4INT_ADCINT4_OFS      (3)                             /* !< ADCINT4 Offset */
#define HSADC_ADCINTFLGFRC_4INT_ADCINT4_MASK     ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT4 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_4INT[ADCDMAINT1] Bits */
#define HSADC_ADCINTFLGFRC_4INT_ADCDMAINT1_OFS   (16)                            /* !< ADCDMAINT1 Offset */
#define HSADC_ADCINTFLGFRC_4INT_ADCDMAINT1_MASK  ((uint32_t)0x00010000U)         /* !< ADC DMA interrupt 1 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT1
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_4INT[ADCDMAINT2] Bits */
#define HSADC_ADCINTFLGFRC_4INT_ADCDMAINT2_OFS   (17)                            /* !< ADCDMAINT2 Offset */
#define HSADC_ADCINTFLGFRC_4INT_ADCDMAINT2_MASK  ((uint32_t)0x00020000U)         /* !< ADC DMA interrupt 2 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT2
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_4INT[ADCDMAINT3] Bits */
#define HSADC_ADCINTFLGFRC_4INT_ADCDMAINT3_OFS   (18)                            /* !< ADCDMAINT3 Offset */
#define HSADC_ADCINTFLGFRC_4INT_ADCDMAINT3_MASK  ((uint32_t)0x00040000U)         /* !< ADC DMA interrupt 3 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT3
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_4INT[ADCDMAINT4] Bits */
#define HSADC_ADCINTFLGFRC_4INT_ADCDMAINT4_OFS   (19)                            /* !< ADCDMAINT4 Offset */
#define HSADC_ADCINTFLGFRC_4INT_ADCDMAINT4_MASK  ((uint32_t)0x00080000U)         /* !< ADC DMA interrupt 4 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT4
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */

/* HSADC_ADCINTFLGFRC_1 Bits */
/* HSADC_ADCINTFLGFRC_1[ADCINT1] Bits */
#define HSADC_ADCINTFLGFRC_1_ADCINT1_OFS         (0)                             /* !< ADCINT1 Offset */
#define HSADC_ADCINTFLGFRC_1_ADCINT1_MASK        ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT1 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_1[ADCINT2] Bits */
#define HSADC_ADCINTFLGFRC_1_ADCINT2_OFS         (1)                             /* !< ADCINT2 Offset */
#define HSADC_ADCINTFLGFRC_1_ADCINT2_MASK        ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT2 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_1[ADCINT3] Bits */
#define HSADC_ADCINTFLGFRC_1_ADCINT3_OFS         (2)                             /* !< ADCINT3 Offset */
#define HSADC_ADCINTFLGFRC_1_ADCINT3_MASK        ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT3 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_1[ADCINT4] Bits */
#define HSADC_ADCINTFLGFRC_1_ADCINT4_OFS         (3)                             /* !< ADCINT4 Offset */
#define HSADC_ADCINTFLGFRC_1_ADCINT4_MASK        ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT4 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_1[ADCDMAINT1] Bits */
#define HSADC_ADCINTFLGFRC_1_ADCDMAINT1_OFS      (16)                            /* !< ADCDMAINT1 Offset */
#define HSADC_ADCINTFLGFRC_1_ADCDMAINT1_MASK     ((uint32_t)0x00010000U)         /* !< ADC DMA interrupt 1 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT1
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_1[ADCDMAINT2] Bits */
#define HSADC_ADCINTFLGFRC_1_ADCDMAINT2_OFS      (17)                            /* !< ADCDMAINT2 Offset */
#define HSADC_ADCINTFLGFRC_1_ADCDMAINT2_MASK     ((uint32_t)0x00020000U)         /* !< ADC DMA interrupt 2 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT2
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_1[ADCDMAINT3] Bits */
#define HSADC_ADCINTFLGFRC_1_ADCDMAINT3_OFS      (18)                            /* !< ADCDMAINT3 Offset */
#define HSADC_ADCINTFLGFRC_1_ADCDMAINT3_MASK     ((uint32_t)0x00040000U)         /* !< ADC DMA interrupt 3 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT3
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC_1[ADCDMAINT4] Bits */
#define HSADC_ADCINTFLGFRC_1_ADCDMAINT4_OFS      (19)                            /* !< ADCDMAINT4 Offset */
#define HSADC_ADCINTFLGFRC_1_ADCDMAINT4_MASK     ((uint32_t)0x00080000U)         /* !< ADC DMA interrupt 4 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT4
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */

