TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCINTFLGCLR_4INT Bits */
/* HSADC_ADCINTFLGCLR_4INT[ADCINT1] Bits */
#define HSADC_ADCINTFLGCLR_4INT_ADCINT1_OFS      (0)                             /* !< ADCINT1 Offset */
#define HSADC_ADCINTFLGCLR_4INT_ADCINT1_MASK     ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Flag Clear. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Clears ADCINT1 and
                                                                                    ADCINT1RESULT flags in the ADCINTFLG,
                                                                                    ADCRAWINTFLG registers.  #br#If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority and the overflow bit will
                                                                                    not be set */
/* HSADC_ADCINTFLGCLR_4INT[ADCINT2] Bits */
#define HSADC_ADCINTFLGCLR_4INT_ADCINT2_OFS      (1)                             /* !< ADCINT2 Offset */
#define HSADC_ADCINTFLGCLR_4INT_ADCINT2_MASK     ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Flag Clear. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Clears ADCINT2 and
                                                                                    ADCINT2RESULT flags in the ADCINTFLG,
                                                                                    ADCRAWINTFLG registers. If software
                                                                                    sets the clear bit on the same cycle
                                                                                    that hardware is trying to set the
                                                                                    flag bit, then hardware has priority
                                                                                    and the overflow bit will not be set */
/* HSADC_ADCINTFLGCLR_4INT[ADCINT3] Bits */
#define HSADC_ADCINTFLGCLR_4INT_ADCINT3_OFS      (2)                             /* !< ADCINT3 Offset */
#define HSADC_ADCINTFLGCLR_4INT_ADCINT3_MASK     ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Flag Clear. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Clears ADCINT3 and
                                                                                    ADCINT3RESULT flags in the ADCINTFLG,
                                                                                    ADCRAWINTFLG registers. #br#  If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority and the overflow bit will
                                                                                    not be set */
/* HSADC_ADCINTFLGCLR_4INT[ADCINT4] Bits */
#define HSADC_ADCINTFLGCLR_4INT_ADCINT4_OFS      (3)                             /* !< ADCINT4 Offset */
#define HSADC_ADCINTFLGCLR_4INT_ADCINT4_MASK     ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Flag Clear. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Clears ADCINT4 and
                                                                                    ADCINT4RESULT flags in the
                                                                                    ADCINTFLG,, ADCRAWINTFLG registers.
                                                                                    #br#If software sets the clear bit on
                                                                                    the same cycle that hardware is
                                                                                    trying to set the flag bit, then
                                                                                    hardware has priority and the
                                                                                    overflow bit will not be set */
/* HSADC_ADCINTFLGCLR_4INT[ADCDMAINT1] Bits */
#define HSADC_ADCINTFLGCLR_4INT_ADCDMAINT1_OFS   (16)                            /* !< ADCDMAINT1 Offset */
#define HSADC_ADCINTFLGCLR_4INT_ADCDMAINT1_MASK  ((uint32_t)0x00010000U)         /* !< ADC DMA Interrupt 1 Flag Clear.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Clears ADDMACINT1
                                                                                    flags in the ADCINTFLG ,ADCRAWINTFLG
                                                                                    registers.  #br#If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */
/* HSADC_ADCINTFLGCLR_4INT[ADCDMAINT2] Bits */
#define HSADC_ADCINTFLGCLR_4INT_ADCDMAINT2_OFS   (17)                            /* !< ADCDMAINT2 Offset */
#define HSADC_ADCINTFLGCLR_4INT_ADCDMAINT2_MASK  ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Flag Clear.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1   Clears ADDMACINT2
                                                                                    flags in the ADCINTFLG ,ADCRAWINTFLG
                                                                                    registers.   #br#If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */
/* HSADC_ADCINTFLGCLR_4INT[ADCDMAINT3] Bits */
#define HSADC_ADCINTFLGCLR_4INT_ADCDMAINT3_OFS   (18)                            /* !< ADCDMAINT3 Offset */
#define HSADC_ADCINTFLGCLR_4INT_ADCDMAINT3_MASK  ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Flag Clear.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1   Clears ADDMACINT3
                                                                                    flags in the ADCINTFLG ,ADCRAWINTFLG
                                                                                    registers.  #br#  If software sets
                                                                                    the clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */
/* HSADC_ADCINTFLGCLR_4INT[ADCDMAINT4] Bits */
#define HSADC_ADCINTFLGCLR_4INT_ADCDMAINT4_OFS   (19)                            /* !< ADCDMAINT4 Offset */
#define HSADC_ADCINTFLGCLR_4INT_ADCDMAINT4_MASK  ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Flag Clear.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Clears ADDMACINT4
                                                                                    flags in the ADCINTFLG ,ADCRAWINTFLG
                                                                                    registers.  #br#If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */

