TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCINTOVFCLR_4INT Bits */
/* HSADC_ADCINTOVFCLR_4INT[ADCINT1OVF] Bits */
#define HSADC_ADCINTOVFCLR_4INT_ADCINT1OVF_OFS   (0)                             /* !< ADCINT1OVF Offset */
#define HSADC_ADCINTOVFCLR_4INT_ADCINT1OVF_MASK  ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Overflow Clear Bits
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit in
                                                                                    the ADCINTOVF register. If software
                                                                                    tries to set this bit on the same
                                                                                    clock cycle that hardware tries to
                                                                                    set the overflow bit in the ADCINTOVF
                                                                                    register, then hardware has priority
                                                                                    and the ADCINTOVF bit will be set. */
/* HSADC_ADCINTOVFCLR_4INT[ADCINT2OVF] Bits */
#define HSADC_ADCINTOVFCLR_4INT_ADCINT2OVF_OFS   (1)                             /* !< ADCINT2OVF Offset */
#define HSADC_ADCINTOVFCLR_4INT_ADCINT2OVF_MASK  ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Overflow Clear Bits
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit in
                                                                                    the ADCINTOVF register. If software
                                                                                    tries to set this bit on the same
                                                                                    clock cycle that hardware tries to
                                                                                    set the overflow bit in the ADCINTOVF
                                                                                    register, then hardware has priority
                                                                                    and the ADCINTOVF bit will be set. */
/* HSADC_ADCINTOVFCLR_4INT[ADCINT3OVF] Bits */
#define HSADC_ADCINTOVFCLR_4INT_ADCINT3OVF_OFS   (2)                             /* !< ADCINT3OVF Offset */
#define HSADC_ADCINTOVFCLR_4INT_ADCINT3OVF_MASK  ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Overflow Clear Bits
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit in
                                                                                    the ADCINTOVF register. If software
                                                                                    tries to set this bit on the same
                                                                                    clock cycle that hardware tries to
                                                                                    set the overflow bit in the ADCINTOVF
                                                                                    register, then hardware has priority
                                                                                    and the ADCINTOVF bit will be set. */
/* HSADC_ADCINTOVFCLR_4INT[ADCINT4OVF] Bits */
#define HSADC_ADCINTOVFCLR_4INT_ADCINT4OVF_OFS   (3)                             /* !< ADCINT4OVF Offset */
#define HSADC_ADCINTOVFCLR_4INT_ADCINT4OVF_MASK  ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Overflow Clear Bits
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit in
                                                                                    the ADCINTOVF register. If software
                                                                                    tries to set this bit on the same
                                                                                    clock cycle that hardware tries to
                                                                                    set the overflow bit in the ADCINTOVF
                                                                                    register, then hardware has priority
                                                                                    and the ADCINTOVF bit will be set. */
/* HSADC_ADCINTOVFCLR_4INT[ADCDMAINT1OVF] Bits */
#define HSADC_ADCINTOVFCLR_4INT_ADCDMAINT1OVF_OFS (16)                            /* !< ADCDMAINT1OVF Offset */
#define HSADC_ADCINTOVFCLR_4INT_ADCDMAINT1OVF_MASK ((uint32_t)0x00010000U)         /* !< ADC DMA Interrupt 1 Overflow Clear
                                                                                    Bits #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit
                                                                                    in the ADCINTOVF register. If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCINTOVF register, then hardware has
                                                                                    priority and the ADCINTOVF bit will
                                                                                    be set. */
/* HSADC_ADCINTOVFCLR_4INT[ADCDMAINT2OVF] Bits */
#define HSADC_ADCINTOVFCLR_4INT_ADCDMAINT2OVF_OFS (17)                            /* !< ADCDMAINT2OVF Offset */
#define HSADC_ADCINTOVFCLR_4INT_ADCDMAINT2OVF_MASK ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Overflow Clear
                                                                                    Bits #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit
                                                                                    in the ADCINTOVF register. If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCINTOVF register, then hardware has
                                                                                    priority and the ADCINTOVF bit will
                                                                                    be set. */
/* HSADC_ADCINTOVFCLR_4INT[ADCDMAINT3OVF] Bits */
#define HSADC_ADCINTOVFCLR_4INT_ADCDMAINT3OVF_OFS (18)                            /* !< ADCDMAINT3OVF Offset */
#define HSADC_ADCINTOVFCLR_4INT_ADCDMAINT3OVF_MASK ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Overflow Clear
                                                                                    Bits #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit
                                                                                    in the ADCINTOVF register. If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCINTOVF register, then hardware has
                                                                                    priority and the ADCINTOVF bit will
                                                                                    be set. */
/* HSADC_ADCINTOVFCLR_4INT[ADCDMAINT4OVF] Bits */
#define HSADC_ADCINTOVFCLR_4INT_ADCDMAINT4OVF_OFS (19)                            /* !< ADCDMAINT4OVF Offset */
#define HSADC_ADCINTOVFCLR_4INT_ADCDMAINT4OVF_MASK ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Overflow Clear
                                                                                    Bits #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit
                                                                                    in the ADCINTOVF register. If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCINTOVF register, then hardware has
                                                                                    priority and the ADCINTOVF bit will
                                                                                    be set. */

/* HSADC_ADCINTOVFCLR_1 Bits */
/* HSADC_ADCINTOVFCLR_1[ADCINT1OVF] Bits */
#define HSADC_ADCINTOVFCLR_1_ADCINT1OVF_OFS      (0)                             /* !< ADCINT1OVF Offset */
#define HSADC_ADCINTOVFCLR_1_ADCINT1OVF_MASK     ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Overflow Clear Bits
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit in
                                                                                    the ADCINTOVF register. If software
                                                                                    tries to set this bit on the same
                                                                                    clock cycle that hardware tries to
                                                                                    set the overflow bit in the ADCINTOVF
                                                                                    register, then hardware has priority
                                                                                    and the ADCINTOVF bit will be set. */
/* HSADC_ADCINTOVFCLR_1[ADCINT2OVF] Bits */
#define HSADC_ADCINTOVFCLR_1_ADCINT2OVF_OFS      (1)                             /* !< ADCINT2OVF Offset */
#define HSADC_ADCINTOVFCLR_1_ADCINT2OVF_MASK     ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Overflow Clear Bits
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit in
                                                                                    the ADCINTOVF register. If software
                                                                                    tries to set this bit on the same
                                                                                    clock cycle that hardware tries to
                                                                                    set the overflow bit in the ADCINTOVF
                                                                                    register, then hardware has priority
                                                                                    and the ADCINTOVF bit will be set. */
/* HSADC_ADCINTOVFCLR_1[ADCINT3OVF] Bits */
#define HSADC_ADCINTOVFCLR_1_ADCINT3OVF_OFS      (2)                             /* !< ADCINT3OVF Offset */
#define HSADC_ADCINTOVFCLR_1_ADCINT3OVF_MASK     ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Overflow Clear Bits
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit in
                                                                                    the ADCINTOVF register. If software
                                                                                    tries to set this bit on the same
                                                                                    clock cycle that hardware tries to
                                                                                    set the overflow bit in the ADCINTOVF
                                                                                    register, then hardware has priority
                                                                                    and the ADCINTOVF bit will be set. */
/* HSADC_ADCINTOVFCLR_1[ADCINT4OVF] Bits */
#define HSADC_ADCINTOVFCLR_1_ADCINT4OVF_OFS      (3)                             /* !< ADCINT4OVF Offset */
#define HSADC_ADCINTOVFCLR_1_ADCINT4OVF_MASK     ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Overflow Clear Bits
                                                                                    #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit in
                                                                                    the ADCINTOVF register. If software
                                                                                    tries to set this bit on the same
                                                                                    clock cycle that hardware tries to
                                                                                    set the overflow bit in the ADCINTOVF
                                                                                    register, then hardware has priority
                                                                                    and the ADCINTOVF bit will be set. */
/* HSADC_ADCINTOVFCLR_1[ADCDMAINT1OVF] Bits */
#define HSADC_ADCINTOVFCLR_1_ADCDMAINT1OVF_OFS   (16)                            /* !< ADCDMAINT1OVF Offset */
#define HSADC_ADCINTOVFCLR_1_ADCDMAINT1OVF_MASK  ((uint32_t)0x00010000U)         /* !< ADC DMA Interrupt 1 Overflow Clear
                                                                                    Bits #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit
                                                                                    in the ADCINTOVF register. If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCINTOVF register, then hardware has
                                                                                    priority and the ADCINTOVF bit will
                                                                                    be set. */
/* HSADC_ADCINTOVFCLR_1[ADCDMAINT2OVF] Bits */
#define HSADC_ADCINTOVFCLR_1_ADCDMAINT2OVF_OFS   (17)                            /* !< ADCDMAINT2OVF Offset */
#define HSADC_ADCINTOVFCLR_1_ADCDMAINT2OVF_MASK  ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Overflow Clear
                                                                                    Bits #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit
                                                                                    in the ADCINTOVF register. If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCINTOVF register, then hardware has
                                                                                    priority and the ADCINTOVF bit will
                                                                                    be set. */
/* HSADC_ADCINTOVFCLR_1[ADCDMAINT3OVF] Bits */
#define HSADC_ADCINTOVFCLR_1_ADCDMAINT3OVF_OFS   (18)                            /* !< ADCDMAINT3OVF Offset */
#define HSADC_ADCINTOVFCLR_1_ADCDMAINT3OVF_MASK  ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Overflow Clear
                                                                                    Bits #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit
                                                                                    in the ADCINTOVF register. If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCINTOVF register, then hardware has
                                                                                    priority and the ADCINTOVF bit will
                                                                                    be set. */
/* HSADC_ADCINTOVFCLR_1[ADCDMAINT4OVF] Bits */
#define HSADC_ADCINTOVFCLR_1_ADCDMAINT4OVF_OFS   (19)                            /* !< ADCDMAINT4OVF Offset */
#define HSADC_ADCINTOVFCLR_1_ADCDMAINT4OVF_MASK  ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Overflow Clear
                                                                                    Bits #br# #br#  0  No action. #br#  1
                                                                                    Clears the respective overflow bit
                                                                                    in the ADCINTOVF register. If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCINTOVF register, then hardware has
                                                                                    priority and the ADCINTOVF bit will
                                                                                    be set. */

