TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCINTSOCSEL2_1 Bits */
/* HSADC_ADCINTSOCSEL2_1[SOC16] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC16_OFS          (0)                             /* !< SOC16 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC16_MASK         ((uint32_t)0x00000003U)         /* !< SOC16 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC16. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC16. TRIGSEL field alone
                                                                                    determines SOC16 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC16. #br#  10
                                                                                    ADCINT2 will trigger SOC16. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC17] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC17_OFS          (2)                             /* !< SOC17 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC17_MASK         ((uint32_t)0x0000000CU)         /* !< SOC17 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC17. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC17. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC17. #br#  10
                                                                                    ADCINT2 will trigger SOC17. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC18] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC18_OFS          (4)                             /* !< SOC18 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC18_MASK         ((uint32_t)0x00000030U)         /* !< SOC18 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC18. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC18. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC18. #br#  10
                                                                                    ADCINT2 will trigger SOC18. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC19] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC19_OFS          (6)                             /* !< SOC19 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC19_MASK         ((uint32_t)0x000000C0U)         /* !< SOC19 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC19. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC19. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC19. #br#  10
                                                                                    ADCINT2 will trigger SOC19. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC20] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC20_OFS          (8)                             /* !< SOC20 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC20_MASK         ((uint32_t)0x00000300U)         /* !< SOC20 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC20. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC20. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC20. #br#  10
                                                                                    ADCINT2 will trigger SOC20. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC21] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC21_OFS          (10)                            /* !< SOC21 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC21_MASK         ((uint32_t)0x00000C00U)         /* !< SOC21 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC21. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC21. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC21. #br#  10
                                                                                    ADCINT2 will trigger SOC21. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC22] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC22_OFS          (12)                            /* !< SOC22 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC22_MASK         ((uint32_t)0x00003000U)         /* !< SOC22 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC22. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC22. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC22. #br#  10
                                                                                    ADCINT2 will trigger SOC22. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC23] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC23_OFS          (14)                            /* !< SOC23 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC23_MASK         ((uint32_t)0x0000C000U)         /* !< SOC23 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC23. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC23. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC23. #br#  10
                                                                                    ADCINT2 will trigger SOC23. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC24] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC24_OFS          (16)                            /* !< SOC24 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC24_MASK         ((uint32_t)0x00030000U)         /* !< SOC24 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC24. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC24. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC24. #br#  10
                                                                                    ADCINT2 will trigger SOC24. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC25] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC25_OFS          (18)                            /* !< SOC25 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC25_MASK         ((uint32_t)0x000C0000U)         /* !< SOC25 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC25. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC25. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC25. #br#  10
                                                                                    ADCINT2 will trigger SOC25. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC26] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC26_OFS          (20)                            /* !< SOC26 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC26_MASK         ((uint32_t)0x00300000U)         /* !< SOC26 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC26. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC26. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC26. #br#  10
                                                                                    ADCINT2 will trigger SOC26. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC27] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC27_OFS          (22)                            /* !< SOC27 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC27_MASK         ((uint32_t)0x00C00000U)         /* !< SOC27 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC27. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC27. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC27. #br#  10
                                                                                    ADCINT2 will trigger SOC27. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC28] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC28_OFS          (24)                            /* !< SOC28 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC28_MASK         ((uint32_t)0x03000000U)         /* !< SOC28 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC28. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC28. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC28. #br#  10
                                                                                    ADCINT2 will trigger SOC28. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC29] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC29_OFS          (26)                            /* !< SOC29 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC29_MASK         ((uint32_t)0x0C000000U)         /* !< SOC29 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC29. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC29. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC29. #br#  10
                                                                                    ADCINT2 will trigger SOC29. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC30] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC30_OFS          (28)                            /* !< SOC30 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC30_MASK         ((uint32_t)0x30000000U)         /* !< SOC30 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC30. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC30. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC30. #br#  10
                                                                                    ADCINT2 will trigger SOC30. #br#  11
                                                                                    Invalid selection. */
/* HSADC_ADCINTSOCSEL2_1[SOC31] Bits */
#define HSADC_ADCINTSOCSEL2_1_SOC31_OFS          (30)                            /* !< SOC31 Offset */
#define HSADC_ADCINTSOCSEL2_1_SOC31_MASK         ((uint32_t)0xC0000000U)         /* !< SOC31 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC31. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC31. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC31. #br#  10
                                                                                    ADCINT2 will trigger SOC31. #br#  11
                                                                                    Invalid selection. */

