TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCSOCFLG1_LITE Bits */
/* HSADC_ADCSOCFLG1_LITE[SOC0] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC0_OFS           (0)                             /* !< SOC0 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC0_MASK          ((uint32_t)0x00000001U)         /* !< SOC0 Start of Conversion Flag.
                                                                                    Indicates the state of SOC0
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC0. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC0. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC0 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC1] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC1_OFS           (1)                             /* !< SOC1 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC1_MASK          ((uint32_t)0x00000002U)         /* !< SOC1 Start of Conversion Flag.
                                                                                    Indicates the state of SOC1
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC1. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC1. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC1 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC2] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC2_OFS           (2)                             /* !< SOC2 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC2_MASK          ((uint32_t)0x00000004U)         /* !< SOC2 Start of Conversion Flag.
                                                                                    Indicates the state of SOC2
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC2. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC2. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC2 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC3] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC3_OFS           (3)                             /* !< SOC3 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC3_MASK          ((uint32_t)0x00000008U)         /* !< SOC3 Start of Conversion Flag.
                                                                                    Indicates the state of SOC3
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC3. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC3. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC3 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC4] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC4_OFS           (4)                             /* !< SOC4 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC4_MASK          ((uint32_t)0x00000010U)         /* !< SOC4 Start of Conversion Flag.
                                                                                    Indicates the state of SOC4
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC4. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC4. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC4 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC5] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC5_OFS           (5)                             /* !< SOC5 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC5_MASK          ((uint32_t)0x00000020U)         /* !< SOC5 Start of Conversion Flag.
                                                                                    Indicates the state of SOC5
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC5. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC5. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC5 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC6] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC6_OFS           (6)                             /* !< SOC6 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC6_MASK          ((uint32_t)0x00000040U)         /* !< SOC6 Start of Conversion Flag.
                                                                                    Indicates the state of SOC6
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC6. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC6. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC6 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC7] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC7_OFS           (7)                             /* !< SOC7 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC7_MASK          ((uint32_t)0x00000080U)         /* !< SOC7 Start of Conversion Flag.
                                                                                    Indicates the state of SOC7
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC7. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC7. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC7 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC8] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC8_OFS           (8)                             /* !< SOC8 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC8_MASK          ((uint32_t)0x00000100U)         /* !< SOC8 Start of Conversion Flag.
                                                                                    Indicates the state of SOC8
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC8. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC8. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC8 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC9] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC9_OFS           (9)                             /* !< SOC9 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC9_MASK          ((uint32_t)0x00000200U)         /* !< SOC9 Start of Conversion Flag.
                                                                                    Indicates the state of SOC9
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC9. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC9. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC9 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC10] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC10_OFS          (10)                            /* !< SOC10 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC10_MASK         ((uint32_t)0x00000400U)         /* !< SOC10 Start of Conversion Flag.
                                                                                    Indicates the state of SOC10
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC10. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC10. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC10 conversion is started. If
                                                                                    contention exists where this bit
