TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC11] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC11_OFS          (11)                            /* !< SOC11 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC11_MASK         ((uint32_t)0x00000800U)         /* !< SOC11 Start of Conversion Flag.
                                                                                    Indicates the state of SOC11
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC11. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC11. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC11 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC12] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC12_OFS          (12)                            /* !< SOC12 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC12_MASK         ((uint32_t)0x00001000U)         /* !< SOC12 Start of Conversion Flag.
                                                                                    Indicates the state of SOC12
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC12. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC12. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC12 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC13] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC13_OFS          (13)                            /* !< SOC13 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC13_MASK         ((uint32_t)0x00002000U)         /* !< SOC13 Start of Conversion Flag.
                                                                                    Indicates the state of SOC13
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC13. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC13. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC13 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC14] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC14_OFS          (14)                            /* !< SOC14 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC14_MASK         ((uint32_t)0x00004000U)         /* !< SOC14 Start of Conversion Flag.
                                                                                    Indicates the state of SOC14
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC14. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC14. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC14 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */
/* HSADC_ADCSOCFLG1_LITE[SOC15] Bits */
#define HSADC_ADCSOCFLG1_LITE_SOC15_OFS          (15)                            /* !< SOC15 Offset */
#define HSADC_ADCSOCFLG1_LITE_SOC15_MASK         ((uint32_t)0x00008000U)         /* !< SOC15 Start of Conversion Flag.
                                                                                    Indicates the state of SOC15
                                                                                    conversions. #br# #br#  0  No sample
                                                                                    pending for SOC15. #br#  1  Trigger
                                                                                    has been received and sample is
                                                                                    pending for SOC15. #br# #br#This bit
                                                                                    will be automatically cleared when
                                                                                    the SOC15 conversion is started. If
                                                                                    contention exists where this bit
                                                                                    receives both a request to set and a
                                                                                    request to clear on the same cycle,
                                                                                    regardless of the source of either,
                                                                                    this bit will be set and the request
                                                                                    to clear will be ignored. In this
                                                                                    case the overflow bit in the
                                                                                    ADCSOCOVF1 register will not be
                                                                                    affected regardless of whether this
                                                                                    bit was previously set or not. */

