TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC14 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC14 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVF1_LITE_CLR[SOC15OVF] Bits */
#define HSADC_ADCSOCOVF1_LITE_CLR_SOC15OVF_OFS   (15)                            /* !< SOC15OVF Offset */
#define HSADC_ADCSOCOVF1_LITE_CLR_SOC15OVF_MASK  ((uint32_t)0x00008000U)         /* !< SOC15 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC15 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC15 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */

/* HSADC_ADCSOCOVFCLR1_1 Bits */
/* HSADC_ADCSOCOVFCLR1_1[SOC0OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC0OVF_OFS        (0)                             /* !< SOC0OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC0OVF_MASK       ((uint32_t)0x00000001U)         /* !< SOC0 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC0 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC0 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC1OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC1OVF_OFS        (1)                             /* !< SOC1OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC1OVF_MASK       ((uint32_t)0x00000002U)         /* !< SOC1 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC1 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC1 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC2OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC2OVF_OFS        (2)                             /* !< SOC2OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC2OVF_MASK       ((uint32_t)0x00000004U)         /* !< SOC2 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC2 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC2 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC3OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC3OVF_OFS        (3)                             /* !< SOC3OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC3OVF_MASK       ((uint32_t)0x00000008U)         /* !< SOC3 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC3 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC3 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC4OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC4OVF_OFS        (4)                             /* !< SOC4OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC4OVF_MASK       ((uint32_t)0x00000010U)         /* !< SOC4 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC4 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC4 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC5OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC5OVF_OFS        (5)                             /* !< SOC5OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC5OVF_MASK       ((uint32_t)0x00000020U)         /* !< SOC5 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC5 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC5 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC6OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC6OVF_OFS        (6)                             /* !< SOC6OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC6OVF_MASK       ((uint32_t)0x00000040U)         /* !< SOC6 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC6 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC6 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC7OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC7OVF_OFS        (7)                             /* !< SOC7OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC7OVF_MASK       ((uint32_t)0x00000080U)         /* !< SOC7 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC7 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC7 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC8OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC8OVF_OFS        (8)                             /* !< SOC8OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC8OVF_MASK       ((uint32_t)0x00000100U)         /* !< SOC8 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC8 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC8 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC9OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC9OVF_OFS        (9)                             /* !< SOC9OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC9OVF_MASK       ((uint32_t)0x00000200U)         /* !< SOC9 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC9 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC9 overflow flag. #br# #br#If
                                                                                    software tries to set this bit on the
                                                                                    same clock cycle that hardware tries
                                                                                    to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC10OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC10OVF_OFS       (10)                            /* !< SOC10OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC10OVF_MASK      ((uint32_t)0x00000400U)         /* !< SOC10 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC10 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC10 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC11OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC11OVF_OFS       (11)                            /* !< SOC11OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC11OVF_MASK      ((uint32_t)0x00000800U)         /* !< SOC11 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC11 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC11 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1_1[SOC12OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_1_SOC12OVF_OFS       (12)                            /* !< SOC12OVF Offset */
#define HSADC_ADCSOCOVFCLR1_1_SOC12OVF_MASK      ((uint32_t)0x00001000U)         /* !< SOC12 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC12 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
