TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCSOC10CTL_M33_ Bits */
/* HSADC_ADCSOC10CTL_M33_[CHSEL] Bits */
#define HSADC_ADCSOC10CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC10CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC10 Channel Select. Selects the
                                                                                    channel to be converted when SOC10 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC10CTL_M33_[COMPEN] Bits */
#define HSADC_ADCSOC10CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC10CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC10 Threshold comparator enable. */

/* HSADC_ADCSOC10CTL_1 Bits */
/* HSADC_ADCSOC10CTL_1[CHSEL] Bits */
#define HSADC_ADCSOC10CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC10CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC10 Channel Select. Selects the
                                                                                    channel to be converted when SOC10 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC10CTL_1[COMPEN] Bits */
#define HSADC_ADCSOC10CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC10CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC10 Threshold comparator enable. */

/* HSADC_ADCSOC11CTL_M33_ Bits */
/* HSADC_ADCSOC11CTL_M33_[CHSEL] Bits */
#define HSADC_ADCSOC11CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC11CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC11 Channel Select. Selects the
                                                                                    channel to be converted when SOC11 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC11CTL_M33_[COMPEN] Bits */
#define HSADC_ADCSOC11CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC11CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC11 Threshold comparator enable. */

/* HSADC_ADCSOC11CTL_1 Bits */
/* HSADC_ADCSOC11CTL_1[CHSEL] Bits */
#define HSADC_ADCSOC11CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC11CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC11 Channel Select. Selects the
                                                                                    channel to be converted when SOC11 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC11CTL_1[COMPEN] Bits */
#define HSADC_ADCSOC11CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC11CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC11 Threshold comparator enable. */

/* HSADC_ADCSOC12CTL_M33_ Bits */
/* HSADC_ADCSOC12CTL_M33_[CHSEL] Bits */
#define HSADC_ADCSOC12CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC12CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC12 Channel Select. Selects the
                                                                                    channel to be converted when SOC12 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC12CTL_M33_[COMPEN] Bits */
#define HSADC_ADCSOC12CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC12CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC12 Threshold comparator enable. */

/* HSADC_ADCSOC12CTL_1 Bits */
/* HSADC_ADCSOC12CTL_1[CHSEL] Bits */
#define HSADC_ADCSOC12CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC12CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC12 Channel Select. Selects the
                                                                                    channel to be converted when SOC12 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC12CTL_1[COMPEN] Bits */
#define HSADC_ADCSOC12CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC12CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC12 Threshold comparator enable. */

