TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCEVTINTSEL_4PPB_ Bits */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB1TRIPHI] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPHI_OFS  (0)                             /* !< PPB1TRIPHI Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPHI_MASK ((uint32_t)0x00000001U)         /* !< Post Processing Block 1 Trip High
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    high flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB1TRIPLO] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPLO_OFS  (1)                             /* !< PPB1TRIPLO Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPLO_MASK ((uint32_t)0x00000002U)         /* !< Post Processing Block 1 Trip Low
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    low flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB1ZERO] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB1ZERO_OFS    (2)                             /* !< PPB1ZERO Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB1ZERO_MASK   ((uint32_t)0x00000004U)         /* !< Post Processing Block 1 Zero
                                                                                    Crossing Interrupt Enable. Setting
                                                                                    this bit allows the corresponding
                                                                                    rising zero crossing flag to activate
                                                                                    the event interrupt signal to the
                                                                                    PIE. The flag must be cleared before
                                                                                    it can produce additional interrupts
                                                                                    to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB1INLIMIT] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB1INLIMIT_OFS (3)                             /* !< PPB1INLIMIT Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB1INLIMIT_MASK ((uint32_t)0x00000008U)         /* !< Post Processing Block 1 Within trip
                                                                                    limit Interrupt Enable. Setting this
                                                                                    bit allows the corresponding rising
                                                                                    zero crossing flag to activate the
                                                                                    event interrupt signal to the PIE.
                                                                                    The flag must be cleared before it
                                                                                    can produce additional interrupts to
                                                                                    the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB2TRIPHI] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB2TRIPHI_OFS  (4)                             /* !< PPB2TRIPHI Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB2TRIPHI_MASK ((uint32_t)0x00000010U)         /* !< Post Processing Block 2 Trip High
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    high flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB2TRIPLO] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB2TRIPLO_OFS  (5)                             /* !< PPB2TRIPLO Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB2TRIPLO_MASK ((uint32_t)0x00000020U)         /* !< Post Processing Block 2 Trip Low
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    low flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB2ZERO] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB2ZERO_OFS    (6)                             /* !< PPB2ZERO Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB2ZERO_MASK   ((uint32_t)0x00000040U)         /* !< Post Processing Block 2 Zero
                                                                                    Crossing Interrupt Enable. Setting
                                                                                    this bit allows the corresponding
                                                                                    rising zero crossing flag to activate
                                                                                    the event interrupt signal to the
                                                                                    PIE. The flag must be cleared before
                                                                                    it can produce additional interrupts
                                                                                    to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB2INLIMIT] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB2INLIMIT_OFS (7)                             /* !< PPB2INLIMIT Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB2INLIMIT_MASK ((uint32_t)0x00000080U)         /* !< Post Processing Block 2 Within trip
                                                                                    limit Interrupt Enable. Setting this
                                                                                    bit allows the corresponding rising
                                                                                    zero crossing flag to activate the
                                                                                    event interrupt signal to the PIE.
                                                                                    The flag must be cleared before it
                                                                                    can produce additional interrupts to
                                                                                    the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB3TRIPHI] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB3TRIPHI_OFS  (8)                             /* !< PPB3TRIPHI Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB3TRIPHI_MASK ((uint32_t)0x00000100U)         /* !< Post Processing Block 3 Trip High
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    high flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB3TRIPLO] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB3TRIPLO_OFS  (9)                             /* !< PPB3TRIPLO Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB3TRIPLO_MASK ((uint32_t)0x00000200U)         /* !< Post Processing Block 3 Trip Low
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    low flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB3ZERO] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB3ZERO_OFS    (10)                            /* !< PPB3ZERO Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB3ZERO_MASK   ((uint32_t)0x00000400U)         /* !< Post Processing Block 3 Zero
                                                                                    Crossing Interrupt Enable. Setting
                                                                                    this bit allows the corresponding
                                                                                    rising zero crossing flag to activate
                                                                                    the event interrupt signal to the
                                                                                    PIE. The flag must be cleared before
                                                                                    it can produce additional interrupts
                                                                                    to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB3INLIMIT] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB3INLIMIT_OFS (11)                            /* !< PPB3INLIMIT Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB3INLIMIT_MASK ((uint32_t)0x00000800U)         /* !< Post Processing Block 3 Within trip
                                                                                    limit Interrupt Enable. Setting this
                                                                                    bit allows the corresponding rising
                                                                                    zero crossing flag to activate the
                                                                                    event interrupt signal to the PIE.
                                                                                    The flag must be cleared before it
                                                                                    can produce additional interrupts to
                                                                                    the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB4TRIPHI] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB4TRIPHI_OFS  (12)                            /* !< PPB4TRIPHI Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB4TRIPHI_MASK ((uint32_t)0x00001000U)         /* !< Post Processing Block 4 Trip High
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    high flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB4TRIPLO] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB4TRIPLO_OFS  (13)                            /* !< PPB4TRIPLO Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB4TRIPLO_MASK ((uint32_t)0x00002000U)         /* !< Post Processing Block 4 Trip Low
                                                                                    Interrupt Enable. Setting this bit
                                                                                    allows the corresponding rising trip
                                                                                    low flag to activate the event
                                                                                    interrupt signal to the PIE. The flag
                                                                                    must be cleared before it can produce
                                                                                    additional interrupts to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB4ZERO] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB4ZERO_OFS    (14)                            /* !< PPB4ZERO Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB4ZERO_MASK   ((uint32_t)0x00004000U)         /* !< Post Processing Block 4 Zero
                                                                                    Crossing Interrupt Enable. Setting
                                                                                    this bit allows the corresponding
                                                                                    rising zero crossing flag to activate
                                                                                    the event interrupt signal to the
                                                                                    PIE. The flag must be cleared before
                                                                                    it can produce additional interrupts
                                                                                    to the PIE. */
/* HSADC_ADCEVTINTSEL_4PPB_[PPB4INLIMIT] Bits */
#define HSADC_ADCEVTINTSEL_4PPB__PPB4INLIMIT_OFS (15)                            /* !< PPB4INLIMIT Offset */
#define HSADC_ADCEVTINTSEL_4PPB__PPB4INLIMIT_MASK ((uint32_t)0x00008000U)         /* !< Post Processing Block 4 Within trip
                                                                                    limit Interrupt Enable. Setting this
                                                                                    bit allows the corresponding rising
                                                                                    zero crossing flag to activate the
                                                                                    event interrupt signal to the PIE.
                                                                                    The flag must be cleared before it
                                                                                    can produce additional interrupts to
                                                                                    the PIE. */

