TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCOSDETECT_HSADC12B_ Bits */
/* HSADC_ADCOSDETECT_HSADC12B_[DETECTCFG] Bits */
#define HSADC_ADCOSDETECT_HSADC12B__DETECTCFG_OFS (0)                             /* !< DETECTCFG Offset */
#define HSADC_ADCOSDETECT_HSADC12B__DETECTCFG_MASK ((uint32_t)0x00000007U)         /* !< ADC Opens and Shorts Detect
                                                                                    Configuration. This bit field defines
                                                                                    the open/shorts detection circuit
                                                                                    state. #br# #br#  0h  Open/Shorts
                                                                                    detection circuit is disabled. #br#
                                                                                    1h  Open/Shorts detection circuit is
                                                                                    enabled at zero scale. #br#  2h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at full scale. #br#  3h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 5/12 scale. #br#
                                                                                    4h  Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 7/12 scale. #br#
                                                                                    5h  Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 5K pulldown
                                                                                    to VSSA. #br#  6h  Open/Shorts
                                                                                    detection circuit is enabled with a
                                                                                    (nominal) 5K pullup to VDDA. #br#  7h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 7K pulldown
                                                                                    to VSSA. */

/* HSADC_ADCOSDETECT_1 Bits */
/* HSADC_ADCOSDETECT_1[DETECTCFG] Bits */
#define HSADC_ADCOSDETECT_1_DETECTCFG_OFS        (0)                             /* !< DETECTCFG Offset */
#define HSADC_ADCOSDETECT_1_DETECTCFG_MASK       ((uint32_t)0x00000007U)         /* !< ADC Opens and Shorts Detect
                                                                                    Configuration. This bit field defines
                                                                                    the open/shorts detection circuit
                                                                                    state. #br# #br#  0h  Open/Shorts
                                                                                    detection circuit is disabled. #br#
                                                                                    1h  Open/Shorts detection circuit is
                                                                                    enabled at zero scale. #br#  2h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at full scale. #br#  3h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 5/12 scale. #br#
                                                                                    4h  Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 7/12 scale. #br#
                                                                                    5h  Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 5K pulldown
                                                                                    to VSSA. #br#  6h  Open/Shorts
                                                                                    detection circuit is enabled with a
                                                                                    (nominal) 5K pullup to VDDA. #br#  7h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 7K pulldown
                                                                                    to VSSA. */

/* HSADC_ADCREV_HSADC12B_ Bits */
/* HSADC_ADCREV_HSADC12B_[TYPE] Bits */
#define HSADC_ADCREV_HSADC12B__TYPE_OFS          (0)                             /* !< TYPE Offset */
#define HSADC_ADCREV_HSADC12B__TYPE_MASK         ((uint32_t)0x000000FFU)         /* !< ADC Type. Always set to 6 for this
                                                                                    HSADC-12b. */
/* HSADC_ADCREV_HSADC12B_[REV] Bits */
#define HSADC_ADCREV_HSADC12B__REV_OFS           (8)                             /* !< REV Offset */
#define HSADC_ADCREV_HSADC12B__REV_MASK          ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

