TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCREV_1 Bits */
/* HSADC_ADCREV_1[TYPE] Bits */
#define HSADC_ADCREV_1_TYPE_OFS                  (0)                             /* !< TYPE Offset */
#define HSADC_ADCREV_1_TYPE_MASK                 ((uint32_t)0x000000FFU)         /* !< ADC Type. Always set to 6 for this
                                                                                    HSADC-12b. */
/* HSADC_ADCREV_1[REV] Bits */
#define HSADC_ADCREV_1_REV_OFS                   (8)                             /* !< REV Offset */
#define HSADC_ADCREV_1_REV_MASK                  ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

/* HSADC_ADCOFFTRIM_LITE_ Bits */
/* HSADC_ADCOFFTRIM_LITE_[OFFTRIM] Bits */
#define HSADC_ADCOFFTRIM_LITE__OFFTRIM_OFS       (0)                             /* !< OFFTRIM Offset */
#define HSADC_ADCOFFTRIM_LITE__OFFTRIM_MASK      ((uint32_t)0x000000FFU)         /* !< ADC Offset Trim #br# #br#Adjusts
                                                                                    the conversion results of the
                                                                                    converter up #br#or down to account
                                                                                    for offset error in the ADC. A
                                                                                    factory trim setting will be loaded
                                                                                    during device boot. #br# #br#Offset
                                                                                    can be corrected in the range of +7
                                                                                    to -8 LSBs. Value is 16*Offset in
                                                                                    8-bit 2's complement: #br# #br#7 LSB
                                                                                    (16*7) = 112 #br#6 LSB (16*6) = 96
                                                                                    #br#5 LSB (16*5) = 80 #br#4 LSB
                                                                                    (16*4) = 64 #br#3 LSB (16*3) = 48
                                                                                    #br#2 LSB (16*2) = 32 #br#1 LSB
                                                                                    (16*1) = 16 #br#0 LSB (16*0) = 0
                                                                                    #br#-1 LSB (16*(-1)) = 240 #br#:
                                                                                    #br#: #br#-7LSB(16*(-7)) = 144 */

/* HSADC_ADCOFFTRIM_1 Bits */
/* HSADC_ADCOFFTRIM_1[OFFTRIM] Bits */
#define HSADC_ADCOFFTRIM_1_OFFTRIM_OFS           (0)                             /* !< OFFTRIM Offset */
#define HSADC_ADCOFFTRIM_1_OFFTRIM_MASK          ((uint32_t)0x000000FFU)         /* !< ADC Offset Trim #br# #br#Adjusts
                                                                                    the conversion results of the
                                                                                    converter up #br#or down to account
                                                                                    for offset error in the ADC. A
                                                                                    factory trim setting will be loaded
                                                                                    during device boot. #br# #br#Offset
                                                                                    can be corrected in the range of +7
                                                                                    to -8 LSBs. Value is 16*Offset in
                                                                                    8-bit 2's complement: #br# #br#7 LSB
                                                                                    (16*7) = 112 #br#6 LSB (16*6) = 96
                                                                                    #br#5 LSB (16*5) = 80 #br#4 LSB
                                                                                    (16*4) = 64 #br#3 LSB (16*3) = 48
                                                                                    #br#2 LSB (16*2) = 32 #br#1 LSB
                                                                                    (16*1) = 16 #br#0 LSB (16*0) = 0
                                                                                    #br#-1 LSB (16*(-1)) = 240 #br#:
                                                                                    #br#: #br#-7LSB(16*(-7)) = 144 */

/* HSADC_ADCCONFIG_12B_ Bits */
/* HSADC_ADCCONFIG_12B_[CONFIG] Bits */
#define HSADC_ADCCONFIG_12B__CONFIG_OFS          (0)                             /* !< CONFIG Offset */
#define HSADC_ADCCONFIG_12B__CONFIG_MASK         ((uint32_t)0xFFFFFFFFU)         /* !< ADC Configuration. This bit field
                                                                                    is used for TI internal
                                                                                    testing/debugging. */

/* HSADC_ADCCONFIG_1 Bits */
/* HSADC_ADCCONFIG_1[CONFIG] Bits */
#define HSADC_ADCCONFIG_1_CONFIG_OFS             (0)                             /* !< CONFIG Offset */
#define HSADC_ADCCONFIG_1_CONFIG_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< ADC Configuration. This bit field
                                                                                    is used for TI internal
                                                                                    testing/debugging. */

