TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB2OFFREF_1 Bits */
/* HSADC_ADCPPB2OFFREF_1[OFFREF] Bits */
#define HSADC_ADCPPB2OFFREF_1_OFFREF_OFS         (0)                             /* !< OFFREF Offset */
#define HSADC_ADCPPB2OFFREF_1_OFFREF_MASK        ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 2 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB2RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC_ADCPPB2TRIPHI_LITE_ Bits */
/* HSADC_ADCPPB2TRIPHI_LITE_[LIMITHI] Bits */
#define HSADC_ADCPPB2TRIPHI_LITE__LIMITHI_OFS    (0)                             /* !< LIMITHI Offset */
#define HSADC_ADCPPB2TRIPHI_LITE__LIMITHI_MASK   ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 2 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC_ADCPPB2TRIPHI_1 Bits */
/* HSADC_ADCPPB2TRIPHI_1[LIMITHI] Bits */
#define HSADC_ADCPPB2TRIPHI_1_LIMITHI_OFS        (0)                             /* !< LIMITHI Offset */
#define HSADC_ADCPPB2TRIPHI_1_LIMITHI_MASK       ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 2 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC_ADCPPB2TRIPLO_LITE_ Bits */
/* HSADC_ADCPPB2TRIPLO_LITE_[LIMITLO] Bits */
#define HSADC_ADCPPB2TRIPLO_LITE__LIMITLO_OFS    (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB2TRIPLO_LITE__LIMITLO_MASK   ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 2 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB2TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC_ADCPPB2TRIPLO_1 Bits */
/* HSADC_ADCPPB2TRIPLO_1[LIMITLO] Bits */
#define HSADC_ADCPPB2TRIPLO_1_LIMITLO_OFS        (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB2TRIPLO_1_LIMITLO_MASK       ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 2 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB2TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

