TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB3OFFREF_LITE_ Bits */
/* HSADC_ADCPPB3OFFREF_LITE_[OFFREF] Bits */
#define HSADC_ADCPPB3OFFREF_LITE__OFFREF_OFS     (0)                             /* !< OFFREF Offset */
#define HSADC_ADCPPB3OFFREF_LITE__OFFREF_MASK    ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 3 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB3RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC_ADCPPB3OFFREF_1 Bits */
/* HSADC_ADCPPB3OFFREF_1[OFFREF] Bits */
#define HSADC_ADCPPB3OFFREF_1_OFFREF_OFS         (0)                             /* !< OFFREF Offset */
#define HSADC_ADCPPB3OFFREF_1_OFFREF_MASK        ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 3 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB3RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC_ADCPPB3TRIPHI_LITE_ Bits */
/* HSADC_ADCPPB3TRIPHI_LITE_[LIMITHI] Bits */
#define HSADC_ADCPPB3TRIPHI_LITE__LIMITHI_OFS    (0)                             /* !< LIMITHI Offset */
#define HSADC_ADCPPB3TRIPHI_LITE__LIMITHI_MASK   ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 3 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC_ADCPPB3TRIPHI_1 Bits */
/* HSADC_ADCPPB3TRIPHI_1[LIMITHI] Bits */
#define HSADC_ADCPPB3TRIPHI_1_LIMITHI_OFS        (0)                             /* !< LIMITHI Offset */
#define HSADC_ADCPPB3TRIPHI_1_LIMITHI_MASK       ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 3 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC_ADCPPB3TRIPLO_LITE_ Bits */
/* HSADC_ADCPPB3TRIPLO_LITE_[LIMITLO] Bits */
#define HSADC_ADCPPB3TRIPLO_LITE__LIMITLO_OFS    (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB3TRIPLO_LITE__LIMITLO_MASK   ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 3 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB3TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC_ADCPPB3TRIPLO_1 Bits */
/* HSADC_ADCPPB3TRIPLO_1[LIMITLO] Bits */
#define HSADC_ADCPPB3TRIPLO_1_LIMITLO_OFS        (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB3TRIPLO_1_LIMITLO_MASK       ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 3 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB3TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC_ADCPPB4CONFIG_M33_ Bits */
/* HSADC_ADCPPB4CONFIG_M33_[CBCEN] Bits */
#define HSADC_ADCPPB4CONFIG_M33__CBCEN_OFS       (5)                             /* !< CBCEN Offset */
#define HSADC_ADCPPB4CONFIG_M33__CBCEN_MASK      ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC_ADCPPB4CONFIG_M33_[TWOSCOMPEN] Bits */
#define HSADC_ADCPPB4CONFIG_M33__TWOSCOMPEN_OFS  (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC_ADCPPB4CONFIG_M33__TWOSCOMPEN_MASK ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 4 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB4RESULT register. #br# #br#  0
                                                                                    ADCPPB4RESULT = ADCRESULTx -
                                                                                    ADCPPB4OFFREF #br#  1  ADCPPB4RESULT
                                                                                    = ADCPPB4OFFREF - ADCRESULTx */

