TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB4OFFREF_LITE_ Bits */
/* HSADC_ADCPPB4OFFREF_LITE_[OFFREF] Bits */
#define HSADC_ADCPPB4OFFREF_LITE__OFFREF_OFS     (0)                             /* !< OFFREF Offset */
#define HSADC_ADCPPB4OFFREF_LITE__OFFREF_MASK    ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB4RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC_ADCPPB4OFFREF_1 Bits */
/* HSADC_ADCPPB4OFFREF_1[OFFREF] Bits */
#define HSADC_ADCPPB4OFFREF_1_OFFREF_OFS         (0)                             /* !< OFFREF Offset */
#define HSADC_ADCPPB4OFFREF_1_OFFREF_MASK        ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB4RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC_ADCPPB4TRIPHI_LITE_ Bits */
/* HSADC_ADCPPB4TRIPHI_LITE_[LIMITHI] Bits */
#define HSADC_ADCPPB4TRIPHI_LITE__LIMITHI_OFS    (0)                             /* !< LIMITHI Offset */
#define HSADC_ADCPPB4TRIPHI_LITE__LIMITHI_MASK   ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC_ADCPPB4TRIPHI_1 Bits */
/* HSADC_ADCPPB4TRIPHI_1[LIMITHI] Bits */
#define HSADC_ADCPPB4TRIPHI_1_LIMITHI_OFS        (0)                             /* !< LIMITHI Offset */
#define HSADC_ADCPPB4TRIPHI_1_LIMITHI_MASK       ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC_ADCPPB4TRIPLO_LITE_ Bits */
/* HSADC_ADCPPB4TRIPLO_LITE_[LIMITLO] Bits */
#define HSADC_ADCPPB4TRIPLO_LITE__LIMITLO_OFS    (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB4TRIPLO_LITE__LIMITLO_MASK   ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB4TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC_ADCPPB4TRIPLO_1 Bits */
/* HSADC_ADCPPB4TRIPLO_1[LIMITLO] Bits */
#define HSADC_ADCPPB4TRIPLO_1_LIMITLO_OFS        (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB4TRIPLO_1_LIMITLO_MASK       ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB4TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC_ADCINTCYCLE_LITE_ Bits */
/* HSADC_ADCINTCYCLE_LITE_[DELAY] Bits */
#define HSADC_ADCINTCYCLE_LITE__DELAY_OFS        (0)                             /* !< DELAY Offset */
#define HSADC_ADCINTCYCLE_LITE__DELAY_MASK       ((uint32_t)0x0000003FU)         /* !< ADC Early Interrupt Generation
                                                                                    Cycle Delay: Defines the delay from
                                                                                    the fall edge of ADCSOC in terms of
                                                                                    system clock cycles, for the
                                                                                    interrupt to be generated. */

/* HSADC_ADCINTCYCLE_1 Bits */
/* HSADC_ADCINTCYCLE_1[DELAY] Bits */
#define HSADC_ADCINTCYCLE_1_DELAY_OFS            (0)                             /* !< DELAY Offset */
#define HSADC_ADCINTCYCLE_1_DELAY_MASK           ((uint32_t)0x0000003FU)         /* !< ADC Early Interrupt Generation
                                                                                    Cycle Delay: Defines the delay from
                                                                                    the fall edge of ADCSOC in terms of
                                                                                    system clock cycles, for the
                                                                                    interrupt to be generated. */

/* HSADC_ADCINLTRIM1_TYPE3P1_ Bits */
/* HSADC_ADCINLTRIM1_TYPE3P1_[INLTRIM31TO0] Bits */
#define HSADC_ADCINLTRIM1_TYPE3P1__INLTRIM31TO0_OFS (0)                             /* !< INLTRIM31TO0 Offset */
#define HSADC_ADCINLTRIM1_TYPE3P1__INLTRIM31TO0_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 31-0. #br#
                                                                                    #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM1_1 Bits */
/* HSADC_ADCINLTRIM1_1[INLTRIM31TO0] Bits */
#define HSADC_ADCINLTRIM1_1_INLTRIM31TO0_OFS     (0)                             /* !< INLTRIM31TO0 Offset */
#define HSADC_ADCINLTRIM1_1_INLTRIM31TO0_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 31-0. #br#
                                                                                    #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM2_TYPE3P1_ Bits */
/* HSADC_ADCINLTRIM2_TYPE3P1_[INLTRIM63TO32] Bits */
#define HSADC_ADCINLTRIM2_TYPE3P1__INLTRIM63TO32_OFS (0)                             /* !< INLTRIM63TO32 Offset */
#define HSADC_ADCINLTRIM2_TYPE3P1__INLTRIM63TO32_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 63-32.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM2_1 Bits */
/* HSADC_ADCINLTRIM2_1[INLTRIM63TO32] Bits */
#define HSADC_ADCINLTRIM2_1_INLTRIM63TO32_OFS    (0)                             /* !< INLTRIM63TO32 Offset */
#define HSADC_ADCINLTRIM2_1_INLTRIM63TO32_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 63-32.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM3_TYPE3P1_ Bits */
/* HSADC_ADCINLTRIM3_TYPE3P1_[INLTRIM95TO64] Bits */
#define HSADC_ADCINLTRIM3_TYPE3P1__INLTRIM95TO64_OFS (0)                             /* !< INLTRIM95TO64 Offset */
#define HSADC_ADCINLTRIM3_TYPE3P1__INLTRIM95TO64_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 95-64.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM3_1 Bits */
/* HSADC_ADCINLTRIM3_1[INLTRIM95TO64] Bits */
#define HSADC_ADCINLTRIM3_1_INLTRIM95TO64_OFS    (0)                             /* !< INLTRIM95TO64 Offset */
#define HSADC_ADCINLTRIM3_1_INLTRIM95TO64_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 95-64.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM4_TYPE3P1_ Bits */
/* HSADC_ADCINLTRIM4_TYPE3P1_[INLTRIM127TO96] Bits */
#define HSADC_ADCINLTRIM4_TYPE3P1__INLTRIM127TO96_OFS (0)                             /* !< INLTRIM127TO96 Offset */
#define HSADC_ADCINLTRIM4_TYPE3P1__INLTRIM127TO96_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 127-96.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM4_1 Bits */
/* HSADC_ADCINLTRIM4_1[INLTRIM127TO96] Bits */
#define HSADC_ADCINLTRIM4_1_INLTRIM127TO96_OFS   (0)                             /* !< INLTRIM127TO96 Offset */
#define HSADC_ADCINLTRIM4_1_INLTRIM127TO96_MASK  ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 127-96.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM5_TYPE3P1_ Bits */
/* HSADC_ADCINLTRIM5_TYPE3P1_[INLTRIM159TO128] Bits */
#define HSADC_ADCINLTRIM5_TYPE3P1__INLTRIM159TO128_OFS (0)                             /* !< INLTRIM159TO128 Offset */
#define HSADC_ADCINLTRIM5_TYPE3P1__INLTRIM159TO128_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 159-128.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM5_1 Bits */
/* HSADC_ADCINLTRIM5_1[INLTRIM159TO128] Bits */
#define HSADC_ADCINLTRIM5_1_INLTRIM159TO128_OFS  (0)                             /* !< INLTRIM159TO128 Offset */
#define HSADC_ADCINLTRIM5_1_INLTRIM159TO128_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 159-128.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM6_TYPE3P1_ Bits */
/* HSADC_ADCINLTRIM6_TYPE3P1_[INLTRIM191TO160] Bits */
#define HSADC_ADCINLTRIM6_TYPE3P1__INLTRIM191TO160_OFS (0)                             /* !< INLTRIM191TO160 Offset */
#define HSADC_ADCINLTRIM6_TYPE3P1__INLTRIM191TO160_MASK ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 191-160.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

