TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB2PSUM_1 Bits */
/* HSADC_ADCPPB2PSUM_1[PSUM] Bits */
#define HSADC_ADCPPB2PSUM_1_PSUM_OFS             (0)                             /* !< PSUM Offset */
#define HSADC_ADCPPB2PSUM_1_PSUM_MASK            ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB2RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB2
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB2RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC_ADCPPB2PSUM_1[SIGN] Bits */
#define HSADC_ADCPPB2PSUM_1_SIGN_OFS             (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB2PSUM_1_SIGN_MASK            ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC_ADCPPB2PMAX Bits */
/* HSADC_ADCPPB2PMAX[PMAX] Bits */
#define HSADC_ADCPPB2PMAX_PMAX_OFS               (0)                             /* !< PMAX Offset */
#define HSADC_ADCPPB2PMAX_PMAX_MASK              ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Partial Max.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB2RESULT the result replaces
                                                                                    this register if it is larger.   #br#
                                                                                    #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB2 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB2RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB2RESULT timing information). */
/* HSADC_ADCPPB2PMAX[SIGN] Bits */
#define HSADC_ADCPPB2PMAX_SIGN_OFS               (17)                            /* !< SIGN Offset */
#define HSADC_ADCPPB2PMAX_SIGN_MASK              ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC_ADCPPB2PMIN Bits */
/* HSADC_ADCPPB2PMIN[PMIN] Bits */
#define HSADC_ADCPPB2PMIN_PMIN_OFS               (0)                             /* !< PMIN Offset */
#define HSADC_ADCPPB2PMIN_PMIN_MASK              ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Partial Min.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB2RESULT the result replaces
                                                                                    this register if it is smaller.
                                                                                    #br# #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB2 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB2RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB2RESULT timing information). */
/* HSADC_ADCPPB2PMIN[SIGN] Bits */
#define HSADC_ADCPPB2PMIN_SIGN_OFS               (17)                            /* !< SIGN Offset */
#define HSADC_ADCPPB2PMIN_SIGN_MASK              ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC_ADCPPB2TRIPLO2 Bits */
/* HSADC_ADCPPB2TRIPLO2[LIMITLO] Bits */
#define HSADC_ADCPPB2TRIPLO2_LIMITLO_OFS         (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB2TRIPLO2_LIMITLO_MASK        ((uint32_t)0x00FFFFFFU)         /* !< ADC Post Processing Block 2 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB2TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO2[23:17] will be ignored in 16
                                                                                    bit mode #br#- TRIPLO2[23:13] will be
                                                                                    ignored in 12 bit mode */

/* HSADC_ADCPPB3LIMIT_LITE_ Bits */
/* HSADC_ADCPPB3LIMIT_LITE_[LIMIT] Bits */
#define HSADC_ADCPPB3LIMIT_LITE__LIMIT_OFS       (0)                             /* !< LIMIT Offset */
#define HSADC_ADCPPB3LIMIT_LITE__LIMIT_MASK      ((uint32_t)0x00000003U)         /* !< Post Processing Block 3
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC_ADCPPB3LIMIT_1 Bits */
/* HSADC_ADCPPB3LIMIT_1[LIMIT] Bits */
#define HSADC_ADCPPB3LIMIT_1_LIMIT_OFS           (0)                             /* !< LIMIT Offset */
#define HSADC_ADCPPB3LIMIT_1_LIMIT_MASK          ((uint32_t)0x00000003U)         /* !< Post Processing Block 3
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC_ADCPPB3PCOUNT_LITE_ Bits */
/* HSADC_ADCPPB3PCOUNT_LITE_[PCOUNT] Bits */
#define HSADC_ADCPPB3PCOUNT_LITE__PCOUNT_OFS     (0)                             /* !< PCOUNT Offset */
#define HSADC_ADCPPB3PCOUNT_LITE__PCOUNT_MASK    ((uint32_t)0x00000007U)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB3PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB3RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB3RESULT timing information). */

