TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCSEQ3CONFIG Bits */
/* HSADC_ADCSEQ3CONFIG[ACQPS] Bits */
#define HSADC_ADCSEQ3CONFIG_ACQPS_OFS            (0)                             /* !< ACQPS Offset */
#define HSADC_ADCSEQ3CONFIG_ACQPS_MASK           ((uint32_t)0x000000FFU)         /* !< SOC3 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC_ADCSEQ3CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC_ADCSEQ3CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC_ADCSEQ3CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC3 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC_ADCSEQ3CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC_ADCSEQ3CONFIG_SAMPCAPRESETSEL_OFS  (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC_ADCSEQ3CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC3 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC_ADCSEQ3CONFIG[SEQSTART] Bits */
#define HSADC_ADCSEQ3CONFIG_SEQSTART_OFS         (15)                            /* !< SEQSTART Offset */
#define HSADC_ADCSEQ3CONFIG_SEQSTART_MASK        ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ3 */
/* HSADC_ADCSEQ3CONFIG[TRIGSEL] Bits */
#define HSADC_ADCSEQ3CONFIG_TRIGSEL_OFS          (20)                            /* !< TRIGSEL Offset */
#define HSADC_ADCSEQ3CONFIG_TRIGSEL_MASK         ((uint32_t)0x00700000U)         /* !< SOC3 Trigger Source Select. Along
                                                                                    with the SOC3 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC3 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC_ADCSEQ3CONFIG[SEQSWFRC] Bits */
#define HSADC_ADCSEQ3CONFIG_SEQSWFRC_OFS         (30)                            /* !< SEQSWFRC Offset */
#define HSADC_ADCSEQ3CONFIG_SEQSWFRC_MASK        ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 3 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC_ADCSEQ3CONFIG[SEQENABLE] Bits */
#define HSADC_ADCSEQ3CONFIG_SEQENABLE_OFS        (31)                            /* !< SEQENABLE Offset */
#define HSADC_ADCSEQ3CONFIG_SEQENABLE_MASK       ((uint32_t)0x80000000U)         /* !< SEQ3Enable #br#Indicates whether
                                                                                    the Sequence3 is enabled or not */

/* HSADC_ADCSEQ4CONFIG Bits */
/* HSADC_ADCSEQ4CONFIG[ACQPS] Bits */
#define HSADC_ADCSEQ4CONFIG_ACQPS_OFS            (0)                             /* !< ACQPS Offset */
#define HSADC_ADCSEQ4CONFIG_ACQPS_MASK           ((uint32_t)0x000000FFU)         /* !< SOC4 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC_ADCSEQ4CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC_ADCSEQ4CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC_ADCSEQ4CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC4 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC_ADCSEQ4CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC_ADCSEQ4CONFIG_SAMPCAPRESETSEL_OFS  (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC_ADCSEQ4CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC4 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC_ADCSEQ4CONFIG[SEQSTART] Bits */
#define HSADC_ADCSEQ4CONFIG_SEQSTART_OFS         (15)                            /* !< SEQSTART Offset */
#define HSADC_ADCSEQ4CONFIG_SEQSTART_MASK        ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ4 */
/* HSADC_ADCSEQ4CONFIG[TRIGSEL] Bits */
#define HSADC_ADCSEQ4CONFIG_TRIGSEL_OFS          (20)                            /* !< TRIGSEL Offset */
#define HSADC_ADCSEQ4CONFIG_TRIGSEL_MASK         ((uint32_t)0x00700000U)         /* !< SOC4 Trigger Source Select. Along
                                                                                    with the SOC4 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC4 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC_ADCSEQ4CONFIG[SEQSWFRC] Bits */
#define HSADC_ADCSEQ4CONFIG_SEQSWFRC_OFS         (30)                            /* !< SEQSWFRC Offset */
#define HSADC_ADCSEQ4CONFIG_SEQSWFRC_MASK        ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 4 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC_ADCSEQ4CONFIG[SEQENABLE] Bits */
#define HSADC_ADCSEQ4CONFIG_SEQENABLE_OFS        (31)                            /* !< SEQENABLE Offset */
#define HSADC_ADCSEQ4CONFIG_SEQENABLE_MASK       ((uint32_t)0x80000000U)         /* !< SEQ4Enable #br#Indicates whether
                                                                                    the Sequence4 is enabled or not */

/* HSADC_PWREN Bits */
/* HSADC_PWREN[ENABLE] Bits */
#define HSADC_PWREN_ENABLE_OFS                   (0)                             /* !< ENABLE Offset */
#define HSADC_PWREN_ENABLE_MASK                  ((uint32_t)0x00000001U)         /* !< Enable the power */
#define HSADC_PWREN_ENABLE_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable Power */
#define HSADC_PWREN_ENABLE_ENABLE                ((uint32_t)0x00000001U)         /* !< Enable Power */
/* HSADC_PWREN[KEY] Bits */
#define HSADC_PWREN_KEY_OFS                      (24)                            /* !< KEY Offset */
#define HSADC_PWREN_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define HSADC_PWREN_KEY_UNLOCK_W                 ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* HSADC_RSTCTL Bits */
/* HSADC_RSTCTL[RESETSTKYCLR] Bits */
#define HSADC_RSTCTL_RESETSTKYCLR_OFS            (1)                             /* !< RESETSTKYCLR Offset */
#define HSADC_RSTCTL_RESETSTKYCLR_MASK           ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define HSADC_RSTCTL_RESETSTKYCLR_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define HSADC_RSTCTL_RESETSTKYCLR_CLR            ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* HSADC_RSTCTL[RESETASSERT] Bits */
#define HSADC_RSTCTL_RESETASSERT_OFS             (0)                             /* !< RESETASSERT Offset */
#define HSADC_RSTCTL_RESETASSERT_MASK            ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define HSADC_RSTCTL_RESETASSERT_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define HSADC_RSTCTL_RESETASSERT_ASSERT          ((uint32_t)0x00000001U)         /* !< Assert reset */
/* HSADC_RSTCTL[KEY] Bits */
#define HSADC_RSTCTL_KEY_OFS                     (24)                            /* !< KEY Offset */
#define HSADC_RSTCTL_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define HSADC_RSTCTL_KEY_UNLOCK_W                ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

