TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_STAT Bits */
/* HSADC_STAT[RESETSTKYCLR] Bits */
#define HSADC_STAT_RESETSTKYCLR_OFS              (16)                            /* !< RESETSTKYCLR Offset */
#define HSADC_STAT_RESETSTKYCLR_MASK             ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define HSADC_STAT_RESETSTKYCLR_NORES            ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define HSADC_STAT_RESETSTKYCLR_RESET            ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* HSADC_FSUB_0 Bits */
/* HSADC_FSUB_0[CHANID] Bits */
#define HSADC_FSUB_0_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define HSADC_FSUB_0_CHANID_MASK                 ((uint32_t)0x0000000FU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define HSADC_FSUB_0_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define HSADC_FSUB_0_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define HSADC_FSUB_0_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* HSADC_FSUB_1 Bits */
/* HSADC_FSUB_1[CHANID] Bits */
#define HSADC_FSUB_1_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define HSADC_FSUB_1_CHANID_MASK                 ((uint32_t)0x0000000FU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define HSADC_FSUB_1_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define HSADC_FSUB_1_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define HSADC_FSUB_1_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* HSADC_FSUB_2 Bits */
/* HSADC_FSUB_2[CHANID] Bits */
#define HSADC_FSUB_2_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define HSADC_FSUB_2_CHANID_MASK                 ((uint32_t)0x0000000FU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define HSADC_FSUB_2_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define HSADC_FSUB_2_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define HSADC_FSUB_2_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* HSADC_FSUB_3 Bits */
/* HSADC_FSUB_3[CHANID] Bits */
#define HSADC_FSUB_3_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define HSADC_FSUB_3_CHANID_MASK                 ((uint32_t)0x0000000FU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define HSADC_FSUB_3_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define HSADC_FSUB_3_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define HSADC_FSUB_3_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* HSADC_FPUB_0 Bits */
/* HSADC_FPUB_0[CHANID] Bits */
#define HSADC_FPUB_0_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define HSADC_FPUB_0_CHANID_MASK                 ((uint32_t)0x0000000FU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define HSADC_FPUB_0_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define HSADC_FPUB_0_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define HSADC_FPUB_0_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* HSADC_FPUB_1 Bits */
/* HSADC_FPUB_1[CHANID] Bits */
#define HSADC_FPUB_1_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define HSADC_FPUB_1_CHANID_MASK                 ((uint32_t)0x0000000FU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define HSADC_FPUB_1_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define HSADC_FPUB_1_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define HSADC_FPUB_1_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

