TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_FPUB_2 Bits */
/* HSADC_FPUB_2[CHANID] Bits */
#define HSADC_FPUB_2_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define HSADC_FPUB_2_CHANID_MASK                 ((uint32_t)0x0000000FU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define HSADC_FPUB_2_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define HSADC_FPUB_2_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define HSADC_FPUB_2_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* HSADC_FPUB_3 Bits */
/* HSADC_FPUB_3[CHANID] Bits */
#define HSADC_FPUB_3_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define HSADC_FPUB_3_CHANID_MASK                 ((uint32_t)0x0000000FU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define HSADC_FPUB_3_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define HSADC_FPUB_3_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define HSADC_FPUB_3_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_hsadc__include */
